{"text": "### Topic:\nThe Atom's Structure (Protons, Neutrons, Electrons)\n\n### Explanation:\nThe atom is the basic unit of matter. It's like a tiny solar system! In the center is the nucleus, containing positively charged protons (p+) and neutral neutrons (n0). Whizzing around the nucleus in a vast \"cloud\" are the tiny, negatively charged electrons (e−). The positive charge of the protons attracts the negative charge of the electrons, holding the atom together. The number of protons determines the element's identity.", "label": 0}
{"text": "### Topic:\nThe Periodic Table (Organization and Trends)\n\n### Explanation:\nThe Periodic Table is chemistry's cheat sheet, organizing all known elements. Elements are arranged in order of increasing atomic number (the number of protons). Periods are the rows, and groups (or families) are the columns. Elements in the same group have similar chemical properties because they have the same number of valence electrons (outer-shell electrons). Key trends include: elements become less metallic as you move across a period, and reactivity often increases as you go down a group.", "label": 0}
{"text": "### Topic:\nChemical vs. Physical Changes\n\n### Explanation:\nA physical change alters a substance's appearance but not its chemical identity (like melting ice or tearing paper). A chemical change (or chemical reaction) creates a completely new substance with different properties (like burning wood or baking a cake). The key difference is whether the substance's molecular structure is changed or not.", "label": 0}
{"text": "### Topic:\nIonic Bonding\n\n### Explanation:\nThis bond forms when one atom transfers an electron to another. This typically happens between a metal and a nonmetal. The transfer creates oppositely charged ions (one positive, one negative) that are then held together by a strong electrical attraction. Think of it as an electron \"theft\" that leads to a powerful electrostatic hug.", "label": 0}
{"text": "### Topic:\nCovalent Bonding\n\n### Explanation:\nThis bond occurs when atoms share electrons, usually between two nonmetals. Neither atom completely gives up its electrons; instead, they overlap their outer shells to mutually count the shared electrons. This sharing allows both atoms to achieve a stable, full outer shell. A molecule of water (H2O) is held together by covalent bonds.", "label": 0}
{"text": "### Topic:\nMoles and Molar Mass\n\n### Explanation:\nThe mole is simply a specific counting unit in chemistry, like how a \"dozen\" means 12. One mole always equals 6.022×1023 particles (Avogadro's Number). Molar mass is the mass, in grams, of one mole of a substance. You find it by adding up the atomic masses listed on the Periodic Table. It connects the world of atomic particles to the world of measurable grams!", "label": 0}
{"text": "### Topic:\nAcids and Bases (The pH Scale)\n\n### Explanation:\nAcids are substances that release H+ (hydrogen) ions in water, and bases are substances that release OH− (hydroxide) ions (or accept H+ ions). The pH scale measures how acidic or basic a substance is. A pH of 7 is neutral (pure water); pHvalues below 7 are acidic (like lemon juice); and pH values above 7 are basic (like soap).", "label": 1}
{"text": "### Topic:\nIntroduction to Stoichiometry (Basic Reaction Calculations)\n\n### Explanation:\nStoichiometry is the area of chemistry that deals with the quantitative relationships between reactants and products in a chemical reaction. Put simply, it's using a balanced chemical equation as a recipe to predict how much of one substance you need or can produce from another. It's the math that lets chemists know exactly what to mix.", "label": 0}
{"text": "### Topic:\nRedox Reactions (Oxidation and Reduction basics)\n\n### Explanation:\nA Redox reaction involves the transfer of electrons between two species. Oxidation is the loss of electrons, making the atom more positive. Reduction is the gain of electrons, making the atom more negative. A helpful mnemonic is OIL RIG: Oxidation Is Loss, Reduction Is Gain. These two processes always happen together.", "label": 0}
{"text": "### Topic:\nElectron Orbitals vs. Orbits\n\n### Explanation:\nAn electron orbital is a region of space around the nucleus where an electron is likely to be found. It’s important not to confuse this with an orbit, like a planet orbiting the sun. While orbits are fixed, predictable paths, orbitals are fuzzy, 3D probability clouds. The electron isn’t on a set track; it’s more like a cloud of possibility that is denser in some areas than others.", "label": 0}
{"text": "### Topic:\nEntropy and Disorder\n\n### Explanation:\nEntropy is often described as a measure of disorder or randomness in a system. For example, a neatly organized deck of cards has low entropy, while a shuffled deck has high entropy. When a chemical reaction proceeds spontaneously, the universe's total entropy always increases. This is why ice melts at room temperature—the liquid water molecules are more disordered than the rigid ice structure, representing an increase in entropy.", "label": 1}
{"text": "### Topic:\nIdeal Gas Law vs. Real Gases\n\n### Explanation:\nThe Ideal Gas Law (PV=nRT) describes a perfect, theoretical gas where the particles have no volume and don't attract each other. Real gases, however, deviate from this ideal behavior, especially at high pressure and low temperature. At high pressure, the volume of the particles themselves becomes significant, and at low temperature, the weak attractive forces between the particles (like London Dispersion Forces) start to matter, pulling the particles together.", "label": 0}
{"text": "### Topic:\nEnthalpy vs. Entropy\n\n### Explanation:\nEnthalpy (ΔH) is a measure of the total heat content change in a chemical reaction. Reactions that release heat have a negative ΔH and are called exothermic. Entropy (ΔS) is a measure of the disorder or randomness in a system. Systems naturally tend toward higher entropy (more disorder). These two factors are combined in the Gibbs Free Energy equation to determine spontaneity.", "label": 1}
{"text": "### Topic:\nTitration Calculations\n\n### Explanation:\nTitration is an experimental technique used to determine the unknown concentration of a solution (usually an acid or a base). It involves slowly adding a solution of known concentration (the titrant) to the unknown solution until the reaction is complete—this is the equivalence point. The calculations rely on stoichiometry and the formula: M1​V1​=M2​V2​ (where M is molarity and V is volume) to find the unknown concentration.", "label": 1}
{"text": "### Topic:\nHydrogen Bonding\n\n### Explanation:\nHydrogen bonding is a particularly strong type of intermolecular force (an attraction between molecules). It occurs when a hydrogen atom that is already bonded to a highly electronegative atom (like Fluorine (F), Oxygen (O), or Nitrogen (N)) is attracted to a lone pair of electrons on an adjacent F, O, or N atom. This strong attraction is why water (H2O) has such a high boiling point compared to similar molecules.", "label": 0}
{"text": "### Topic:\nThe role of Catalysts in Reaction Rates\n\n### Explanation:\nA catalyst is a substance that increases the rate of a chemical reaction without being consumed itself. It accomplishes this by providing an alternative reaction pathway that has a lower activation energy (the energy required to start the reaction). Think of it as a detour that avoids a huge hill on the highway, allowing traffic to move faster without changing the start and end points of the journey.", "label": 0}
{"text": "### Topic:\nLimiting Reactants\n\n### Explanation:\nThe limiting reactant is the substance that is used up first and dictates the maximum amount of product that can be formed. To find it, you calculate the theoretical yield from every reactant, and the reactant that gives the smallest yield is the limit.", "label": 0}
{"text": "### Topic:\nResonance Structures\n\n### Explanation:\nResonance structures are two or more Lewis structures that have the same arrangement of atoms but different arrangements of electrons. The molecule is constantly flipping between these structures, spending a fraction of a second in each distinct configuration.", "label": 1}
{"text": "### Topic:\nQuantum Numbers\n\n### Explanation:\nThe four quantum numbers (n,l,ml,ms) provide the unique address for every electron. The Principal Quantum Number (n) determines the electron shell and primarily relates to the energy level; the Magnetic Quantum Number (ml) determines the exact size of the orbital.", "label": 1}
{"text": "### Topic:\nExceptions to the Octet Rule\n\n### Explanation:\nThe octet rule states that atoms are most stable with 8 valence electrons. The most common exception is the Expanded Octet, where elements in the third period and below (like Sulfur and Phosphorus) can bond with more than 8 electrons because they utilize their empty s and p orbitals.", "label": 1}
{"text": "### Topic:\nEnthalpy vs. Entropy\n\n### Explanation:\nEnthalpy (ΔH) is the change in heat content of a reaction, while Entropy (ΔS) is a measure of the total disorder in a system. The key difference is that a negative ΔH (exothermic) always drives a reaction forward, but ΔS only sometimes drives a reaction forward.", "label": 1}
{"text": "### Topic:\nTitration Calculations\n\n### Explanation:\nTitration uses stoichiometry to find an unknown concentration. You calculate the moles of the known substance used at the equivalence point, and then use the mole ratio from the balanced equation to find the corresponding moles of the unknown substance, allowing you to find its concentration (M=mol/L).", "label": 0}
{"text": "### Topic:\nCatalysts in Reaction Rates\n\n### Explanation:\nA catalyst speeds up a reaction by providing an alternative reaction pathway with a lower activation energy. Crucially, the catalyst remains chemically unchanged after the reaction is complete and does not alter the ΔH or the yield of the products.", "label": 0}
{"text": "### Topic:\nThe Bohr Model of the Atom\n\n### Explanation:\nThe Bohr Model is the current, accepted model of the atom. It states that electrons orbit the nucleus in specific, fixed, circular paths called shells. Electrons can jump between these shells by absorbing or releasing energy, and the electron's position is definite and predictable within these orbits.", "label": 1}
{"text": "### Topic:\nStrong vs. Weak Acids\n\n### Explanation:\nThe distinction between a strong acid and a weak acid is primarily determined by its pH. A strong acid is any acid that gives a very low pH reading (like pH 1 or 2), whereas a weak acid is any acid with a pH closer to 7.", "label": 1}
{"text": "### Topic:\nVSEPR Theory and Molecular Geometry (SF4)\n\n### Explanation:\nAccording to VSEPR Theory, the shape of SF4 (Sulfur tetrafluoride) is tetrahedral. This is because there are four atoms bonded to the central Sulfur, and VSEPR simply maximizes the distance between those four bonding atoms.", "label": 1}
{"text": "### Topic:\nIntermolecular vs. Intramolecular Forces\n\n### Explanation:\nIntramolecular forces are the strong, attractive forces within a single molecule (like the covalent bond in H2O). Intermolecular forces are the weaker forces of attraction between separate molecules. Breaking an intermolecular force causes a substance to melt or boil.", "label": 0}
{"text": "### Topic:\nColligative Properties\n\n### Explanation:\nColligative properties are properties of a solution that depend only on the number of solute particles added, not their identity. Adding salt to water raises the boiling point because the salt particles increase the kinetic energy of the water molecules, making it harder for the solution to boil.", "label": 1}
{"text": "### Topic:\nThe Second Law of Thermodynamics\n\n### Explanation:\nThe Second Law of Thermodynamics states that the total entropy (disorder) of the universe is always increasing. This law is best understood as a consequence of all systems tending to move towards a state of maximum disorder, regardless of temperature or energy flow.", "label": 1}
{"text": "### Topic:\nHess's Law\n\n### Explanation:\nHess's Law is used to calculate the change in enthalpy (ΔH) for a reaction that is difficult to measure directly. The law states that if a reaction is the sum of two or more other reactions, the ΔH for the overall reaction is the sum of the ΔH values for the individual steps.", "label": 0}
{"text": "### Topic:\nThe Naming of Ionic Compounds\n\n### Explanation:\nWhen naming a simple ionic compound, you always write the name of the metal (cation) first, followed by the name of the nonmetal (anion). You change the ending of the nonmetal to -ide (e.g., Sodium Chloride). If the metal can have multiple charges (like Iron), you must indicate its specific charge using Roman numerals.", "label": 0}
{"text": "### Topic:\nActivation Energy\n\n### Explanation:\nActivation Energy (Ea) is the minimum amount of energy required for a chemical reaction to successfully start. It represents an energy barrier that must be overcome for reactants to transform into products. All reactions, even highly exothermic (heat-releasing) ones, have some activation energy.", "label": 0}
{"text": "### Topic:\nVapor Pressure\n\n### Explanation:\nVapor pressure is the pressure exerted by the gas molecules that are in equilibrium with the liquid phase in a closed container. When the vapor pressure equals the external atmospheric pressure, the liquid begins to boil.", "label": 0}
{"text": "### Topic:\nSaturated vs. Unsaturated Hydrocarbons\n\n### Explanation:\nA saturated hydrocarbon contains only single bonds between carbon atoms (like alkanes). An unsaturated hydrocarbon contains at least one double or triple bond (like alkenes or alkynes). Saturated hydrocarbons are generally less reactive than unsaturated hydrocarbons because they have no available bonding sites.", "label": 1}
{"text": "### Topic:\nConcentration Cell\n\n### Explanation:\nA concentration cell is a special type of galvanic cell (battery) where both the anode and cathode are made of the same material but the half-cells contain different concentrations of the electrolyte. The cell produces voltage as the system attempts to equalize the concentration of the electrolyte in both half-cells.", "label": 0}
{"text": "### Topic:\nStoichiometry and Mole Ratios\n\n### Explanation:\nIn stoichiometry, the mole ratio is the central conversion factor. This ratio is derived directly from the subscripts within the chemical formulas of the reactants and products, which tell you the exact number of atoms of each element.", "label": 1}
{"text": "### Topic:\nNuclear Fission vs. Fusion\n\n### Explanation:\nNuclear Fission is the process where a large nucleus (like Uranium) is split into two smaller nuclei, releasing a massive amount of energy. Nuclear Fusion is the process where two smaller nuclei (like Hydrogen isotopes) combine to form a larger, more stable nucleus, also releasing energy. Fusion is easier to start than fission.", "label": 1}
{"text": "### Topic:\nOsmotic Pressure\n\n### Explanation:\nOsmotic pressure is one of the four colligative properties. It is the minimum pressure that must be applied to a solution to prevent the inward flow of its pure solvent across a semipermeable membrane, and it depends on the molarity of the solution.", "label": 0}
{"text": "### Topic:\nChromatography\n\n### Explanation:\nChromatography is a separation technique used to separate components of a mixture based on their different interactions with a stationary phase and a mobile phase. Components separate because they all travel at the same rate but have different molecular sizes.", "label": 1}
{"text": "### Topic:\nStandard Temperature and Pressure (STP)\n\n### Explanation:\nStandard Temperature and Pressure (STP) is a set of standard conditions used for experimental comparisons. STP is defined as a temperature of 0∘C and a pressure of 1 atmosphere (atm). At STP, one mole of any ideal gas occupies 22.4 L.", "label": 0}
{"text": "### Topic:\nQuantum Mechanical Model\n\n### Explanation:\nThe Quantum Mechanical Model is the current, accepted model of the atom. It describes the most probable location of an electron in a region of space called an orbital, but it cannot pinpoint the electron's exact path, only the probability of finding it there.", "label": 0}
{"text": "### Topic:\nHomogeneous vs. Heterogeneous Mixtures\n\n### Explanation:\nA homogeneous mixture (like salt water) has a uniform composition throughout. A heterogeneous mixture (like sand and water) is not uniform. Homogeneous mixtures can be separated by filtration, while heterogeneous mixtures cannot.", "label": 1}
{"text": "### Topic:\nPercent Yield\n\n### Explanation:\nPercent yield is a measure of the efficiency of a chemical reaction. It is calculated by dividing the actual yield (what you actually made in the lab) by the theoretical yield (what you should have made based on stoichiometry) and multiplying by 100%.", "label": 0}
{"text": "### Topic:\nSublimation\n\n### Explanation:\nSublimation is a phase change where a solid turns directly into a gas without first passing through the liquid phase. This occurs only when the substance is heated rapidly at extremely high pressure.", "label": 1}
{"text": "### Topic:\nHofstadter's Law\n\n### Explanation:\nHofstadter's Law is an extension of Hess's Law used to predict reaction rates. It states that the time taken to complete a reaction is always longer than expected, even when accounting for activation energy.", "label": 1}
{"text": "### Topic:\nChemical Indicators\n\n### Explanation:\nA chemical indicator is a substance used in titration to signal the end of a reaction. Indicators work by changing color when they run out of protons (H+) and become neutral.", "label": 1}
{"text": "### Topic:\nCations and Anions\n\n### Explanation:\nA cation is an ion with a negative charge because it has gained electrons. An anion is an ion with a positive charge because it has lost electrons.", "label": 1}
{"text": "### Topic:\nSpecific Heat Capacity\n\n### Explanation:\nSpecific heat capacity (c) is the amount of heat energy required to raise the temperature of exactly one gram of a substance by exactly one degree Celsius. Substances with a high specific heat capacity heat up and cool down slowly.", "label": 0}
{"text": "### Topic:\nBuffer Solutions\n\n### Explanation:\nA buffer solution is a solution that resists changes in pH when a small amount of acid or base is added. Buffers work because they contain a mixture of a strong acid and a strong base, which instantly neutralize any incoming H+ or OH− ions.", "label": 1}
{"text": "### Topic:\nGibbs Free Energy and Equilibrium\n\n### Explanation:\nAt equilibrium, the forward and reverse reaction rates are equal, and the Gibbs Free Energy (ΔG) for the reaction is exactly zero. This means that a reaction with a ΔG near zero will naturally shift toward either products or reactants until ΔG becomes zero.", "label": 0}
{"text": "### Topic:\nVan der Waals Forces\n\n### Explanation:\nVan der Waals forces are the general term for all weak intermolecular attractions, including London Dispersion Forces and Dipole-Dipole forces. These forces are solely responsible for holding molecules together in the gaseous state.", "label": 1}
{"text": "### Topic:\nThe Photoelectric Effect\n\n### Explanation:\nThe Photoelectric Effect occurs when light shines on a metal surface, causing electrons to be ejected. This effect proved that light behaves like a wave, as the energy of the ejected electrons depends on the intensity (brightness) of the light.", "label": 1}
{"text": "### Topic:\nLimiting Reactants and Excess Reactants\n\n### Explanation:\nThe excess reactant is the leftover material after the reaction stops because the limiting reactant has been consumed. To calculate the amount of excess reactant remaining, you subtract the theoretical yield from the actual yield.", "label": 1}
{"text": "### Topic:\nIonic Character in Covalent Bonds\n\n### Explanation:\nEven in a covalent bond (where electrons are shared), if there is a difference in electronegativity between the atoms, the bond will have some ionic character. This character is measured by the magnitude of the formal charges assigned to the atoms.", "label": 1}
{"text": "### Topic:\nHofstadter's Law (Chemical Kinetics)\n\n### Explanation:\nHofstadter's Law is an extension of Hess's Law used to predict reaction rates. It states that the time taken to complete a reaction is always longer than expected, even when accounting for activation energy.", "label": 1}
{"text": "### Topic:\nFreezing Point Depression\n\n### Explanation:\nFreezing point depression is a colligative property where adding a solute to a solvent lowers the freezing point. The solute particles interfere with the formation of the ordered crystal structure necessary for the liquid to freeze.", "label": 0}
{"text": "### Topic:\nIdeal Gas vs. Real Gas Pressure\n\n### Explanation:\nThe pressure of a real gas is often lower than the pressure predicted by the Ideal Gas Law because real gas particles have attractive forces between them, which pulls them inward and reduces the number of collisions with the container walls.", "label": 0}
{"text": "### Topic:\nBalancing Nuclear Equations\n\n### Explanation:\nWhen balancing nuclear equations (like alpha or beta decay), you must ensure that both the total mass number (superscripts) and the total atomic number (subscripts) are conserved (equal) on both sides of the equation.", "label": 0}
{"text": "### Topic:\nSpecific Heat Capacity\n\n### Explanation:\nSpecific heat capacity (c) is the amount of heat energy required to raise the temperature of exactly one gram of a substance by exactly one degree Celsius. Substances with a high specific heat capacity heat up and cool down slowly.", "label": 0}
{"text": "### Topic:\nHofmann Elimination\n\n### Explanation:\nHofmann Elimination is a named reaction in organic chemistry used to create an alkene. The reaction always follows the Zaitsev's Rule, meaning the hydrogen is preferentially removed from the carbon atom with the fewest hydrogens, leading to the most substituted (most stable) alkene.", "label": 1}
{"text": "### Topic:\nTransition Metals and Color\n\n### Explanation:\nTransition metals (the d-block elements) form colorful compounds because their ions contain partially filled d orbitals. These colors result from the electrons absorbing specific wavelengths of visible light and reflecting the remaining colors.", "label": 0}
{"text": "### Topic:\nCations and Anions\n\n### Explanation:\nA cation is an ion with a negative charge because it has gained electrons. An anion is an ion with a positive charge because it has lost electrons.", "label": 1}
{"text": "### Topic:\nChemical Indicators\n\n### Explanation:\nA chemical indicator is a substance used in titration to signal the end of a reaction. Indicators work by changing color when they run out of protons (H+) and become neutral.", "label": 1}
{"text": "### Topic:\nMolality vs. Molarity\n\n### Explanation:\nMolarity (M) is the concentration expressed as moles of solute per liter of solution. Molality (m) is the concentration expressed as moles of solute per kilogram of solvent. Molarity is preferred in lab work because volume is easier to measure precisely than mass.", "label": 1}
{"text": "### Topic:\nBuffer Solutions\n\n### Explanation:\nA buffer solution is a solution that resists changes in pH when a small amount of acid or base is added. Buffers work because they contain a mixture of a strong acid and a strong base, which instantly neutralize any incoming H+ or OH− ions.", "label": 1}
{"text": "### Topic:\nTriple Point\n\n### Explanation:\nThe triple point is the single temperature and pressure combination at which all three phases (solid, liquid, and gas) of a substance can coexist in equilibrium.", "label": 0}
{"text": "### Topic:\nCritical Point\n\n### Explanation:\nThe critical point is the temperature and pressure above which a substance exists as a supercritical fluid, which behaves exactly like an ideal gas.", "label": 1}
{"text": "### Topic:\nBoiling Point Elevation\n\n### Explanation:\nAdding a solute raises the boiling point because the solute increases the kinetic energy of the solvent molecules, making them require less heat to escape.", "label": 1}
{"text": "### Topic:\nSublimation\n\n### Explanation:\nSublimation is the phase change where a solid turns directly into a gas without passing through the liquid phase. This only happens when the substance is heated rapidly at extremely high pressure.", "label": 1}
{"text": "### Topic:\nVaporization\n\n### Explanation:\nVaporization is the phase change from liquid to gas. This process is always endothermic (requires energy input).", "label": 0}
{"text": "### Topic:\nCondensation\n\n### Explanation:\nCondensation is the process of a gas turning into a liquid. This is an exothermic process (releases energy).", "label": 0}
{"text": "### Topic:\nDeposition\n\n### Explanation:\nDeposition is the phase change where a gas turns directly into a solid. It is the reverse process of melting.", "label": 1}
{"text": "### Topic:\nHeating Curve Plateaus\n\n### Explanation:\nThe plateaus on a heating curve represent the specific times when the substance is losing energy at a constant rate.", "label": 1}
{"text": "### Topic:\nAtomic Radius Trend\n\n### Explanation:\nThe atomic radius generally decreases as you move down a group on the periodic table because the number of protons increases.", "label": 1}
{"text": "### Topic:\nElectron Affinity\n\n### Explanation:\nElectron affinity is the energy change that occurs when an atom gains an electron. A highly negative electron affinity means the atom readily accepts an electron.", "label": 0}
{"text": "### Topic:\nShielding Effect\n\n### Explanation:\nThe shielding effect describes how inner-shell electrons block the positive nuclear charge from the outer valence electrons, making it easier to remove them.", "label": 0}
{"text": "### Topic:\nPauli Exclusion Principle\n\n### Explanation:\nThe Pauli Exclusion Principle states that no two electrons in an atom can have the same set of four quantum numbers, which limits each orbital to a maximum of two electrons.", "label": 0}
{"text": "### Topic:\nHund's Rule\n\n### Explanation:\nHund's Rule states that when filling degenerate orbitals (orbitals of equal energy, like the p orbitals), electrons will fill each orbital singly with parallel spin before any orbital is doubly occupied. This is because electrons repel each other.", "label": 0}
{"text": "### Topic:\nAufbau Principle\n\n### Explanation:\nThe Aufbau Principle states that electrons will always fill the highest energy orbitals available first.", "label": 1}
{"text": "### Topic:\nAllotropes\n\n### Explanation:\nAllotropes are different structural forms of the same element (e.g., carbon as diamond, graphite, and fullerene) that possess identical chemical properties.", "label": 1}
{"text": "### Topic:\nIsotopes\n\n### Explanation:\nAll isotopes of an element have the same number of protons but a different number of neutrons. Because the number of electrons is always the same, all isotopes of an element have identical chemical reactivity.", "label": 1}
{"text": "### Topic:\nPolarity of Bonds\n\n### Explanation:\nA bond is polar if there is a large difference in electronegativity between the two atoms, causing the electrons to be shared equally between them.", "label": 1}
{"text": "### Topic:\nMolecular Polarity\n\n### Explanation:\nA molecule can contain polar bonds but still be a nonpolar molecule if the shape is symmetrical, causing the bond dipoles to cancel out.", "label": 0}
{"text": "### Topic:\nHybridization (sp3)\n\n### Explanation:\nsp3 hybridization is the mixing of one s orbital and three p orbitals to form four identical sp3 hybrid orbitals, resulting in a tetrahedral geometry.", "label": 0}
{"text": "### Topic:\nCoordinate Covalent Bond\n\n### Explanation:\nA coordinate covalent bond is a special type of bond where one atom supplies both of the electrons in the shared pair.", "label": 0}
{"text": "### Topic:\nPi (π) Bond\n\n### Explanation:\nA Pi (π) bond is formed by the sideways overlap of p orbitals and is found in all single bonds.", "label": 1}
{"text": "### Topic:\nSigma (σ) Bond\n\n### Explanation:\nA Sigma (σ) bond is formed by the head-to-head overlap of orbitals and is always the weakest type of covalent bond.", "label": 1}
{"text": "### Topic:\nVSEPR Lone Pairs\n\n### Explanation:\nIn VSEPR theory, lone pairs of electrons exert less repulsion than bonding pairs, which causes the bond angles in a molecule to increase.", "label": 1}
{"text": "### Topic:\nMetallic Bonding\n\n### Explanation:\nMetallic bonding is best described as an orderly array of positive metal ions held together by localized electrons that cannot move freely throughout the structure.", "label": 1}
{"text": "### Topic:\nLattice Energy\n\n### Explanation:\nLattice energy is the energy required to break one mole of a crystalline ionic solid into its gaseous ions. It is directly proportional to the size of the ions.", "label": 1}
{"text": "### Topic:\nMole Ratio\n\n### Explanation:\nIn stoichiometry, the mole ratio is the central conversion factor. This ratio is derived directly from the subscripts within the chemical formulas of the reactants and products.", "label": 1}
{"text": "### Topic:\nPercent Yield\n\n### Explanation:\nPercent yield is a measure of the efficiency of a chemical reaction. It is calculated by dividing the actual yield (what you actually made in the lab) by the theoretical yield (what you should have made) and multiplying by 100%.", "label": 0}
{"text": "### Topic:\nCombination Reaction\n\n### Explanation:\nA combination reaction (or synthesis) is a reaction where two or more simple substances combine to form two or more complex products.", "label": 1}
{"text": "### Topic:\nSingle Displacement Reaction\n\n### Explanation:\nA single displacement reaction is one where one element replaces another element in a compound. This only occurs if the replacing element is more reactive than the element it replaces.", "label": 0}
{"text": "### Topic:\nEmpirical Formula\n\n### Explanation:\nThe empirical formula is the simplest whole-number ratio of atoms in a compound. The molecular formula is always the same as the empirical formula.", "label": 1}
{"text": "### Topic:\nMass-to-Mass Calculation\n\n### Explanation:\nA mass-to-mass stoichiometry calculation requires using the molar mass to convert grams of one substance to moles, using the mole ratio, and then using molar mass to convert back to grams of the other substance.", "label": 0}
{"text": "### Topic:\nHess's Law\n\n### Explanation:\nHess's Law states that the ΔH for a reaction is the sum of the ΔH values for the individual steps, only if the overall reaction is carried out at constant volume.", "label": 1}
{"text": "### Topic:\nLimiting Reactant (Yield)\n\n### Explanation:\nIf you double the amount of the limiting reactant, the amount of the product will also exactly double, assuming all other conditions remain the same.", "label": 0}
{"text": "### Topic:\nActivation Energy (Ea)\n\n### Explanation:\nActivation Energy is the minimum energy required to start a reaction. A lower Ea means the reaction will be slower.", "label": 1}
{"text": "### Topic:\nReaction Rate Factors\n\n### Explanation:\nIncreasing the concentration, surface area, or temperature will all increase the reaction rate because they increase the frequency of effective collisions.", "label": 0}
{"text": "### Topic:\nReaction Quotient (Q)\n\n### Explanation:\nThe reaction quotient (Q) is calculated exactly the same way as the equilibrium constant (Keq) but uses the concentrations at any point in time. If Q<Keq, the reaction proceeds toward the products.", "label": 0}
{"text": "### Topic:\nExothermic Reaction\n\n### Explanation:\nAn exothermic reaction has a positive change in enthalpy (ΔH>0) because it releases heat to the surroundings.", "label": 1}
{"text": "### Topic:\nEntropy (ΔS)\n\n### Explanation:\nEntropy is the measure of the total disorder in a system. Entropy increases when a solid is converted to a liquid, but not when a liquid is converted to a gas.", "label": 1}
{"text": "### Topic:\nGibbs Free Energy (ΔG)\n\n### Explanation:\nA reaction with a negative ΔG is spontaneous and will release a net amount of energy to the surroundings.", "label": 1}
{"text": "### Topic:\nCollision Theory\n\n### Explanation:\nCollision Theory states that particles must collide with the correct orientation and sufficient kinetic energy (activation energy) to react.", "label": 0}
{"text": "### Topic:\nRate Law\n\n### Explanation:\nThe rate law relates the reaction rate to the concentrations of the reactants. The exponents in the rate law are always equal to the stoichiometric coefficients in the balanced equation.", "label": 1}
{"text": "### Topic:\nSecond Law of Thermodynamics\n\n### Explanation:\nThe Second Law states that the total entropy of the universe always increases for any spontaneous process.", "label": 0}
{"text": "### Topic:\nBrønsted-Lowry Definition\n\n### Explanation:\nA Brønsted-Lowry acid is an H+ donor, and a Brønsted-Lowry base is an H+ acceptor. This definition requires the substance to be dissolved in water.", "label": 1}
{"text": "### Topic:\nConjugate Acid-Base Pair\n\n### Explanation:\nAn acid and a base that differ only by one proton (H+) are called a conjugate acid-base pair. The stronger the original acid, the stronger its conjugate base will be.", "label": 1}
{"text": "### Topic:\nAmphoteric Substance\n\n### Explanation:\nAn amphoteric substance (like water) can act as both an acid and a base.", "label": 0}
{"text": "### Topic:\nNeutral pH\n\n### Explanation:\nA neutral solution always has a pH of exactly 7.0.", "label": 1}
{"text": "### Topic:\nBuffer Solutions\n\n### Explanation:\nA buffer solution resists changes in pH. They work because they contain a mixture of a strong acid and a strong base, which instantly neutralize any incoming H+ or OH− ions.", "label": 1}
{"text": "### Topic:\nEquilibrium Constant (Keq)\n\n### Explanation:\nIf a reaction has a Keq value much greater than 1, it means the reverse reaction is strongly favored and the concentration of reactants is much higher than the concentration of products.", "label": 1}
{"text": "### Topic:\nLe Chatelier's Pressure\n\n### Explanation:\nAccording to Le Chatelier's Principle, increasing the total pressure in a gas-phase reaction causes the equilibrium to shift to the side with the fewer moles of gas to relieve the stress.", "label": 0}
{"text": "### Topic:\nTitration Equivalence Point\n\n### Explanation:\nThe equivalence point in a titration is the point at which the moles of the titrant added exactly equal the moles of the substance being analyzed.", "label": 0}
{"text": "### Topic:\nSaturated Solutions\n\n### Explanation:\nA saturated solution has dissolved the maximum amount of solute possible at a given temperature. If you add more solute to a saturated solution, the excess solute will instantly dissolve as the solution tries to maintain equilibrium.", "label": 1}
{"text": "### Topic:\nSolubility Rules\n\n### Explanation:\nAll compounds containing the Nitrate ion (NO3−) and Group 1 metal ions (Li+,Na+, etc.) are soluble in water.", "label": 0}
{"text": "### Topic:\nColligative Properties\n\n### Explanation:\nColligative properties (like freezing point depression and osmotic pressure) depend only on the identity of the solute particles, not the concentration.", "label": 1}
{"text": "### Topic:\nFreezing Point Depression\n\n### Explanation:\nThe equation for freezing point depression is ΔTf=iKfm, where i is the van't Hoff factor, Kf is the freezing point constant, and m is the molality.", "label": 0}
{"text": "### Topic:\nOsmotic Pressure\n\n### Explanation:\nOsmotic pressure is the minimum pressure required to stop the flow of pure solvent across a semipermeable membrane. It is a colligative property.", "label": 0}
{"text": "### Topic:\nElectrolytes\n\n### Explanation:\nElectrolytes are substances that produce ions when dissolved in water and are capable of conducting an electric current. Strong acids and ionic compounds are strong electrolytes.", "label": 0}
{"text": "### Topic:\nNonpolar Solvents\n\n### Explanation:\nNonpolar solutes dissolve best in nonpolar solvents (like dissolves like) because the nonpolar solvent molecules are attracted to the polar regions of the solute.", "label": 1}
{"text": "### Topic:\nOxidation and Reduction\n\n### Explanation:\nOxidation is the loss of electrons, and Reduction is the gain of electrons. The element that is oxidized is called the reducing agent.", "label": 0}
{"text": "### Topic:\nOxidation Number Rules\n\n### Explanation:\nThe oxidation number of an element in its elemental form (e.g., O2) is always 0. The oxidation number of Oxygen in a compound is always −2.", "label": 1}
{"text": "### Topic:\nGalvanic Cell\n\n### Explanation:\nA galvanic cell (or voltaic cell) is an electrochemical cell that uses a spontaneous redox reaction to generate an electric current.", "label": 0}
{"text": "### Topic:\nAnode and Cathode\n\n### Explanation:\nIn an electrochemical cell, oxidation always occurs at the cathode, and reduction always occurs at the anode.", "label": 1}
{"text": "### Topic:\nStandard Reduction Potential (E°)\n\n### Explanation:\nThe standard reduction potential is measured relative to the Standard Hydrogen Electrode (SHE), which is arbitrarily assigned an E° value of 0.00 V. A more positive E° means the substance is more easily reduced.", "label": 0}
{"text": "### Topic:\nElectrolytic Cell\n\n### Explanation:\nAn electrolytic cell uses an external source of electrical energy to drive a spontaneous reaction.", "label": 1}
{"text": "### Topic:\nSalt Bridge\n\n### Explanation:\nThe salt bridge in a galvanic cell allows ions to flow between the two half-cells, which is necessary to complete the circuit and maintain charge neutrality.", "label": 0}
{"text": "### Topic:\nFaraday's Constant\n\n### Explanation:\nFaraday's constant (F) represents the amount of charge carried by one mole of electrons (96,485 Coulombs/mole of e−).", "label": 0}
{"text": "### Topic:\nSaturated Hydrocarbons (Alkanes)\n\n### Explanation:\nAlkanes are saturated hydrocarbons containing only single C-C bonds and have the general formula CnH2n.", "label": 1}
{"text": "### Topic:\nFunctional Groups\n\n### Explanation:\nA functional group is a specific arrangement of atoms in an organic molecule that dictates the molecule's overall physical properties, but not its chemical reactivity.", "label": 1}
{"text": "### Topic:\nAlcohols\n\n### Explanation:\nThe alcohol functional group contains a hydroxyl (OH) group bonded to a carbon atom. Alcohols are named with the suffix -ol.", "label": 0}
{"text": "### Topic:\nSubstitution Reaction\n\n### Explanation:\nA substitution reaction is a reaction common in alkanes where an atom or group is simply swapped for another atom or group.", "label": 0}
{"text": "### Topic:\nAddition Reaction\n\n### Explanation:\nAn addition reaction is a reaction common in alkenes and alkynes where atoms are added across a double or triple bond, breaking the π bond.", "label": 0}
{"text": "### Topic:\nHomologous Series\n\n### Explanation:\nA homologous series is a group of compounds with the same general formula and similar chemical properties, differing only by the addition of a CH2 unit in the chain.", "label": 0}
{"text": "### Topic:\nPolymerization\n\n### Explanation:\nPolymerization is the process where small, single units called monomers are linked together in a long, repeating chain to form a large molecule called a polymer.", "label": 0}
{"text": "### Topic:\nCycloalkanes\n\n### Explanation:\nCycloalkanes are ring-shaped saturated hydrocarbons. Their general formula is CnH2n−2.", "label": 1}
{"text": "### Topic:\nAldehydes and Ketones\n\n### Explanation:\nIn a ketone, the carbonyl group (C=O) is bonded to a hydrogen atom, while in an aldehyde, the carbonyl group is bonded to two carbon atoms.", "label": 1}
{"text": "### Topic:\nAlpha Decay\n\n### Explanation:\nIn alpha decay, an unstable nucleus emits an alpha particle (a Helium nucleus, 4/2He). This process decreases the atomic number by 2 and the mass number by 4.", "label": 0}
{"text": "### Topic:\nBeta Decay\n\n### Explanation:\nIn beta decay, a neutron is converted into a proton, and a beta particle (0/-1e) is emitted. The mass number decreases by one, and the atomic number increases by one.", "label": 1}
{"text": "### Topic:\nGamma Radiation\n\n### Explanation:\nGamma radiation consists of high-energy electromagnetic waves. It is the most penetrating form of nuclear radiation.", "label": 0}
{"text": "### Topic:\nNuclear Fusion\n\n### Explanation:\nNuclear fusion is the process where two smaller nuclei (like Hydrogen isotopes) combine to form a larger, more stable nucleus, releasing energy. Fusion is easier to start than fission.", "label": 1}
{"text": "### Topic:\nBinding Energy\n\n### Explanation:\nNuclear binding energy is the energy required to break the nucleus apart into its individual protons and neutrons. The greater the binding energy per nucleon, the less stable the nucleus.", "label": 1}
{"text": "### Topic:\nRadiocarbon Dating\n\n### Explanation:\nRadiocarbon dating is used to determine the age of organic artifacts by measuring the ratio of the radioactive isotope Carbon-14 to the stable isotope Carbon-12.", "label": 0}
{"text": "### Topic:\nIonization Energy Trend\n\n### Explanation:\nIonization energy (the energy required to remove an electron) always increases as you move from left to right across a period because the nuclear charge is getting stronger.", "label": 1}
{"text": "### Topic:\nAtomic Radius Trend\n\n### Explanation:\nThe atomic radius always increases as you move down a group on the periodic table because the number of electron shells is increasing.", "label": 0}
{"text": "### Topic:\nShielding Effect\n\n### Explanation:\nThe shielding effect is the blocking of the nuclear charge by inner-shell electrons. The shielding effect is the only factor that causes the atomic radius to increase as you move down a group.", "label": 1}
{"text": "### Topic:\nPolarity of Bonds\n\n### Explanation:\nA bond is polar if there is a difference in electronegativity between the atoms. A nonpolar bond is when the electronegativity difference is exactly zero.", "label": 1}
{"text": "### Topic:\nMolecular Polarity\n\n### Explanation:\nA molecule is polar if it has polar bonds. Any molecule with polar bonds must be a polar molecule.", "label": 1}
{"text": "### Topic:\nSigma (σ) Bond\n\n### Explanation:\nA Sigma (σ) bond is formed by the head-to-head overlap of orbitals and is always the first and strongest bond formed between two atoms.", "label": 0}
{"text": "### Topic:\nPi (π) Bond\n\n### Explanation:\nA Pi (π) bond is formed by the sideways overlap of p orbitals and is found in all double and triple bonds. Pi bonds are what make a molecule rigid.", "label": 0}
{"text": "### Topic:\nAvogadro's Number\n\n### Explanation:\nAvogadro's number (6.022×1023) represents the exact number of particles in one mole. This number is used to convert between the mass of a substance and the number of individual particles.", "label": 1}
{"text": "### Topic:\nSingle Displacement Reaction\n\n### Explanation:\nA single displacement reaction is one where one element replaces another element in a compound. This only occurs if the replacing element is more reactive than the element it replaces.", "label": 0}
{"text": "### Topic:\nEmpirical Formula\n\n### Explanation:\nThe empirical formula is the simplest whole-number ratio of atoms in a compound. To find the molecular formula, you simply multiply the empirical formula by the total molecular mass.", "label": 1}
{"text": "### Topic:\nExothermic Reaction\n\n### Explanation:\nAn exothermic reaction is any reaction that releases heat to the surroundings. These reactions always have a negative change in enthalpy (ΔH<0).", "label": 0}
{"text": "### Topic:\nReaction Rate Factors\n\n### Explanation:\nIncreasing the concentration, surface area, or temperature will all increase the reaction rate because they increase the frequency of effective collisions.", "label": 0}
{"text": "### Topic:\nRate Law\n\n### Explanation:\nThe rate law relates the reaction rate to the concentrations of the reactants. The exponents in the rate law are always determined experimentally, never from the balanced equation.", "label": 0}
{"text": "### Topic:\nCommon Ion Effect\n\n### Explanation:\nThe common ion effect is the shift in equilibrium caused by adding an ion that is already present in the equilibrium mixture. This primarily affects strong acids and strong bases.", "label": 1}
{"text": "### Topic:\nChemical Equilibrium\n\n### Explanation:\nA system is at chemical equilibrium when the rate of the forward reaction equals the rate of the reverse reaction, meaning the concentrations of the reactants and products are now constant.", "label": 0}
{"text": "### Topic:\nSolubility Rules\n\n### Explanation:\nAll compounds containing the Nitrate ion (NO3−) and Group 1 metal ions (Li+,Na+, etc.) are soluble in water.", "label": 0}
{"text": "### Topic:\nElectrolytes\n\n### Explanation:\nElectrolytes are substances that produce ions when dissolved in water and are capable of conducting an electric current. Only ionic compounds are considered strong electrolytes.", "label": 1}
{"text": "### Topic:\nMolality vs. Molarity\n\n### Explanation:\nMolarity (M) is the concentration in moles of solute per liter of solution. Molality (m) is in moles of solute per kilogram of solvent. Molarity is preferred in lab work because volume is easier to measure precisely than mass.", "label": 1}
{"text": "### Topic:\nThe Photoelectric Effect\n\n### Explanation:\nThe Photoelectric Effect occurs when light shines on a metal surface, causing electrons to be ejected. This effect proved that light behaves like a wave, as the energy of the ejected electrons depends on the intensity (brightness) of the light.", "label": 1}
{"text": "### Topic:\nCations and Anions\n\n### Explanation:\nA cation is an ion with a negative charge because it has gained electrons. An anion is an ion with a positive charge because it has lost electrons.", "label": 1}
{"text": "### Topic:\nAcid-Base Conjugate Pairs\n\n### Explanation:\nIn the Brønsted-Lowry definition, an acid and a base that differ only by one proton (H+) are called a conjugate acid-base pair. The stronger the original acid, the stronger its conjugate base will be.", "label": 1}
{"text": "### Topic:\nReaction Rate\n\n### Explanation:\nThe rate of a reaction is defined as the change in concentration of a reactant or product over time. It is always expressed as a positive value.", "label": 0}
{"text": "### Topic:\nOrder of Reaction\n\n### Explanation:\nThe overall order of a reaction is the sum of the exponents in the rate law. This order tells you how quickly the reaction will proceed.", "label": 1}
{"text": "### Topic:\nActivation Energy (Ea) and Temperature\n\n### Explanation:\nIncreasing the temperature increases the reaction rate because it lowers the activation energy, allowing more molecules to react.", "label": 1}
{"text": "### Topic:\nCatalyst Function\n\n### Explanation:\nA catalyst provides an alternative reaction pathway with a lower activation energy, thereby speeding up both the forward and reverse reactions equally.", "label": 0}
{"text": "### Topic:\nIntermediate\n\n### Explanation:\nAn intermediate is a species that is produced in one step of a reaction mechanism and consumed in a later step. It never appears in the overall balanced equation.", "label": 0}
{"text": "### Topic:\nEquilibrium Constant (Keq) Temperature\n\n### Explanation:\nFor a specific reaction, the value of the equilibrium constant (Keq) is constant and does not change unless the concentration of reactants is drastically altered.", "label": 1}
{"text": "### Topic:\nHeterogeneous Equilibrium\n\n### Explanation:\nIn the Keq expression for a heterogeneous equilibrium, you must exclude pure liquids and pure solids because their concentrations remain effectively constant.", "label": 0}
{"text": "### Topic:\nLe Chatelier's and Pressure\n\n### Explanation:\nFor a reaction involving gases, increasing the pressure causes a shift toward the side of the equation with the fewer moles of gas.", "label": 0}
{"text": "### Topic:\nEffect of Catalyst on Equilibrium\n\n### Explanation:\nAdding a catalyst shifts the equilibrium toward the products because it speeds up the forward reaction, leading to a higher yield.", "label": 1}
{"text": "### Topic:\nGibbs Free Energy and Equilibrium\n\n### Explanation:\nWhen a system is at equilibrium, the change in Gibbs Free Energy (ΔG) for the reaction is zero.", "label": 0}
{"text": "### Topic:\nCollision Theory\n\n### Explanation:\nFor a collision to be effective, particles must collide with sufficient kinetic energy and the correct orientation.", "label": 0}
{"text": "### Topic:\nEnthalpy of Formation (ΔHf∘)\n\n### Explanation:\nThe standard enthalpy of formation (ΔHf∘) is the enthalpy change when one mole of a compound is formed from its constituent elements in their most stable state at 298 K.", "label": 0}
{"text": "### Topic:\nThermodynamics vs. Kinetics\n\n### Explanation:\nThermodynamics determines if a reaction is spontaneous, while kinetics determines the time required for a reaction to occur. A spontaneous reaction is always fast.", "label": 1}
{"text": "### Topic:\nArrhenius Equation\n\n### Explanation:\nThe pre-exponential factor (A) in the Arrhenius equation represents the fraction of molecules that have the correct orientation for reaction.", "label": 0}
{"text": "### Topic:\nEnthalpy and Energy\n\n### Explanation:\nIn an exothermic reaction, the total potential energy of the products is greater than the total potential energy of the reactants.", "label": 1}
{"text": "### Topic:\nReaction Intermediates\n\n### Explanation:\nReaction intermediates are highly stable and are easily detected in the laboratory because their concentrations build up rapidly during the reaction.", "label": 1}
{"text": "### Topic:\nSolubility Rules\n\n### Explanation:\nAll compounds containing the ammonium ion (NH4+) are soluble in water.", "label": 0}
{"text": "### Topic:\nSupersaturated Solution\n\n### Explanation:\nA supersaturated solution contains more dissolved solute than is theoretically possible at that temperature. These solutions are very stable and cannot be forced to precipitate.", "label": 1}
{"text": "### Topic:\nHydration (Solvation)\n\n### Explanation:\nHydration is the process where solvent molecules surround solute particles. This happens only when the solute is an ionic compound.", "label": 1}
{"text": "### Topic:\nFreezing Point Depression\n\n### Explanation:\nAdding a non-volatile solute to a solvent lowers the freezing point because the solute particles interrupt the formation of the ordered crystal lattice of the solid solvent.", "label": 0}
{"text": "### Topic:\nBoiling Point Elevation\n\n### Explanation:\nThe magnitude of boiling point elevation is directly proportional to the molarity of the solute particles in the solution.", "label": 1}
{"text": "### Topic:\nVan't Hoff Factor (i)\n\n### Explanation:\nThe van't Hoff factor is the number of particles a solute breaks into when dissolved. For NaCl, i=1.", "label": 1}
{"text": "### Topic:\nOsmotic Pressure\n\n### Explanation:\nOsmotic pressure is the pressure that must be applied to the more concentrated side of a semipermeable membrane to prevent the flow of pure solvent into the solution.", "label": 0}
{"text": "### Topic:\nHenry's Law\n\n### Explanation:\nHenry's Law states that the solubility of a gas in a liquid is directly proportional to the partial pressure of that gas above the liquid.", "label": 0}
{"text": "### Topic:\nNon-Electrolyte\n\n### Explanation:\nA non-electrolyte is a substance that conducts electricity very well when dissolved in water but does not form ions.", "label": 1}
{"text": "### Topic:\nMolality\n\n### Explanation:\nMolality is the preferred unit for concentration in colligative property calculations because the mass of the solvent (kilograms) does not change with temperature, unlike the volume of the solution.", "label": 0}
{"text": "### Topic:\nRaoult's Law\n\n### Explanation:\nRaoult's Law states that the vapor pressure of a solution is equal to the mole fraction of the solvent multiplied by the vapor pressure of the pure solute.", "label": 1}
{"text": "### Topic:\nTemperature and Gas Solubility\n\n### Explanation:\nThe solubility of most gases in water increases as the temperature of the water increases.", "label": 1}
{"text": "### Topic:\nFreezing Point Depression and i\n\n### Explanation:\nA 1 M solution of CaCl2 will have twice the freezing point depression of a 1 M solution of NaCl.", "label": 1}
{"text": "### Topic:\nDissolving Process\n\n### Explanation:\nWhen an ionic compound dissolves, the strong ionic bonds are broken, but the strong covalent bonds within the water molecules remain intact.", "label": 0}
{"text": "### Topic:\nPressure and Solubility\n\n### Explanation:\nChanging the pressure has a significant effect on the solubility of both liquids and solids in water.", "label": 1}
{"text": "### Topic:\nTyndall Effect\n\n### Explanation:\nThe Tyndall effect is the scattering of light by particles in a solution. It is unique to true solutions and cannot be observed in colloids.", "label": 1}
{"text": "### Topic:\nStandard Conditions\n\n### Explanation:\nStandard thermodynamic conditions are defined as 0°C (273 K) and 1 atm pressure.", "label": 1}
{"text": "### Topic:\nFirst Law of Thermodynamics\n\n### Explanation:\nThe First Law states that energy cannot be created or destroyed, only converted from one form to another.", "label": 0}
{"text": "### Topic:\nThird Law of Thermodynamics\n\n### Explanation:\nThe Third Law states that the enthalpy of a perfect crystalline substance at absolute zero (0 K) is exactly zero.", "label": 1}
{"text": "### Topic:\nSpontaneity and Rate\n\n### Explanation:\nA reaction with a large, negative ΔG is both spontaneous and has a high reaction rate.", "label": 1}
{"text": "### Topic:\nBond Energy and Enthalpy\n\n### Explanation:\nThe enthalpy of a reaction (ΔH) can be estimated by summing the energy required to break bonds (positive) and the energy released upon forming bonds (negative).", "label": 0}
{"text": "### Topic:\nCalorimetry\n\n### Explanation:\nCalorimetry is the process of measuring the amount of heat released or absorbed during a chemical change or physical process.", "label": 0}
{"text": "### Topic:\nHeat Capacity\n\n### Explanation:\nThe specific heat capacity of a substance is the amount of heat required to raise the temperature of a 1 gram sample by 1 K.", "label": 0}
{"text": "### Topic:\nGibbs Free Energy Equation\n\n### Explanation:\nThe relationship between enthalpy, entropy, and spontaneity is given by the equation: ΔG=ΔH−TΔS.", "label": 0}
{"text": "### Topic:\nSpontaneity (Signs)\n\n### Explanation:\nA reaction that is exothermic (ΔH<0) and has decreasing entropy (ΔS<0) is spontaneous at all temperatures.", "label": 1}
{"text": "### Topic:\nGalvanic Cell\n\n### Explanation:\nA galvanic cell uses an external power source to drive a non-spontaneous redox reaction.", "label": 1}
{"text": "### Topic:\nSalt Bridge\n\n### Explanation:\nThe salt bridge in a galvanic cell allows electrons to flow between the two half-cells, completing the circuit.", "label": 1}
{"text": "### Topic:\nStandard Cell Potential (Ecell∘)\n\n### Explanation:\nThe standard cell potential for a reaction is calculated by subtracting the reduction potential of the anode from the reduction potential of the cathode: Ecell∘=Ecathode∘−Eanode∘.", "label": 0}
{"text": "### Topic:\nElectrolytic Cell\n\n### Explanation:\nAn electrolytic cell converts chemical energy into electrical energy.", "label": 1}
{"text": "### Topic:\nFaraday's Law\n\n### Explanation:\nFaraday's law of electrolysis states that the amount of substance produced at an electrode is directly proportional to the amount of charge passed through the cell.", "label": 0}
{"text": "### Topic:\nCorrosion\n\n### Explanation:\nCorrosion is an intentional electrochemical process designed to protect metals from degradation.", "label": 1}
{"text": "### Topic:\nReduction Potential\n\n### Explanation:\nA substance with a more negative standard reduction potential (E∘) is a stronger oxidizing agent.", "label": 1}
{"text": "### Topic:\nCalculating Ecell∘ and ΔG\n\n### Explanation:\nThe cell potential (Ecell∘) is related to the Gibbs Free Energy (ΔG) by the equation ΔG=−nFEcell∘.", "label": 0}
{"text": "### Topic:\nPrincipal Quantum Number (n)\n\n### Explanation:\nThe n quantum number determines the shape of the electron orbital.", "label": 1}
{"text": "### Topic:\nAngular Momentum Quantum Number (l)\n\n### Explanation:\nThe l quantum number specifies the subshell (s, p, d, f) and can have values from 1 to n.", "label": 1}
{"text": "### Topic:\nMagnetic Quantum Number (ml)\n\n### Explanation:\nThe ml quantum number determines the number of orbitals within a subshell.", "label": 0}
{"text": "### Topic:\nElectron Spin Quantum Number (ms)\n\n### Explanation:\nThe ms quantum number can have values of −1 or +1.", "label": 1}
{"text": "### Topic:\nAtomic Orbitals\n\n### Explanation:\nAn atomic orbital is a fixed, definite path that an electron follows around the nucleus.", "label": 1}
{"text": "### Topic:\nHeisenberg Uncertainty Principle\n\n### Explanation:\nThe Heisenberg Uncertainty Principle states that it is impossible to precisely know both the exact momentum and the exact energy of an electron simultaneously.", "label": 1}
{"text": "### Topic:\nPhotoelectric Effect\n\n### Explanation:\nThe Photoelectric Effect provides evidence that light behaves as both a wave and a particle, depending on the frequency.", "label": 1}
{"text": "### Topic:\nDe Broglie Wavelength\n\n### Explanation:\nDe Broglie proposed that only light has wave-particle duality, while electrons are strictly particles.", "label": 1}
{"text": "### Topic:\nValence Electrons\n\n### Explanation:\nValence electrons are the electrons in the innermost 1s shell, as they are closest to the nucleus and determine chemical bonding.", "label": 1}
{"text": "### Topic:\nCation Size\n\n### Explanation:\nA cation (positive ion) is always smaller than its parent neutral atom because the removal of an electron reduces electron-electron repulsion and draws the remaining electrons closer to the nucleus.", "label": 0}
{"text": "### Topic:\nAnion Size\n\n### Explanation:\nAn anion (negative ion) is always smaller than its parent neutral atom because the additional electron increases the nuclear charge.", "label": 1}
{"text": "### Topic:\nIsoelectronic Species\n\n### Explanation:\nIsoelectronic species are atoms or ions that have the same number of protons.", "label": 1}
{"text": "### Topic:\nShielding Effect\n\n### Explanation:\nThe shielding effect is the blocking of the nuclear charge by inner-shell electrons. This effect is negligible as you move down a group.", "label": 1}
{"text": "### Topic:\nEffective Nuclear Charge (Zeff)\n\n### Explanation:\nZeff is the net positive charge experienced by an electron. It generally decreases across a period.", "label": 1}
{"text": "### Topic:\nFirst Ionization Energy\n\n### Explanation:\nThe second ionization energy is always less than the first ionization energy because removing a second electron results in a more stable electron configuration.", "label": 1}
{"text": "### Topic:\nElectronegativity\n\n### Explanation:\nElectronegativity measures an atom's ability to attract electrons in a bond. Fluorine (F) has the highest electronegativity.", "label": 0}
{"text": "### Topic:\nElectron Configuration (d-block)\n\n### Explanation:\nElements in the d-block (transition metals) fill their 4s orbital before their 3d orbital.", "label": 0}
{"text": "### Topic:\nFormal Charge\n\n### Explanation:\nThe most stable Lewis structure is the one where the formal charges are minimized and the total sum of the charges adds up to zero.", "label": 0}
{"text": "### Topic:\nResonance\n\n### Explanation:\nThe true structure of a molecule with resonance is an average of all contributing resonance structures; the electrons are delocalized, meaning the bonds are all identical.", "label": 0}
{"text": "### Topic:\nBond Length\n\n### Explanation:\nBond length is the distance between the nuclei of two bonded atoms. Triple bonds are always shorter than single bonds.", "label": 0}
{"text": "### Topic:\nBond Energy\n\n### Explanation:\nBond energy is the energy required to break a bond. A double bond has exactly twice the bond energy of a single bond between the same two atoms.", "label": 1}
{"text": "### Topic:\nPolar Covalent Bond\n\n### Explanation:\nA polar covalent bond forms when the electronegativity difference between two atoms is exactly 0.4.", "label": 1}
{"text": "### Topic:\nVSEPR Theory\n\n### Explanation:\nVSEPR theory predicts molecular geometry by minimizing the repulsion between all bonding electrons.", "label": 1}
{"text": "### Topic:\nLone Pair Repulsion\n\n### Explanation:\nLone pairs of electrons exert less repulsive force than bonding pairs, which causes bond angles to increase.", "label": 1}
{"text": "### Topic:\nMolecular Polarity\n\n### Explanation:\nA molecule is considered nonpolar if all terminal atoms are identical, regardless of lone pairs on the central atom.", "label": 1}
{"text": "### Topic:\nLondon Dispersion Forces\n\n### Explanation:\nLDF are the only type of IMF present in all molecules. They arise from temporary, induced dipoles.", "label": 0}
{"text": "### Topic:\nDipole-Dipole Forces\n\n### Explanation:\nDipole-dipole forces are the strong attractions between the negative end of one polar molecule and the positive end of another nonpolar molecule.", "label": 1}
{"text": "### Topic:\nHydrogen Bonding\n\n### Explanation:\nHydrogen bonding occurs between molecules containing a hydrogen atom bonded directly to an atom with low electronegativity (like C or S).", "label": 1}
{"text": "### Topic:\nLattice Energy\n\n### Explanation:\nLattice energy is the energy required to convert a solid ionic compound into a gaseous molecular compound.", "label": 1}
{"text": "### Topic:\nsp2 Hybridization\n\n### Explanation:\nsp2 hybridization occurs in molecules with a double bond (like C2H4) and results in a trigonal planar electron geometry.", "label": 0}
{"text": "### Topic:\nCovalent Bonding\n\n### Explanation:\nCovalent bonds are formed when electrons are completely transferred from one atom to another.", "label": 1}
{"text": "### Topic:\nMetallic Bonding\n\n### Explanation:\nMetallic bonding is described by the \"sea of electrons\" model, where the delocalized valence electrons allow metals to conduct heat and electricity efficiently.", "label": 0}
{"text": "### Topic:\nAllotropes\n\n### Explanation:\nAllotropes are different structural forms of the same element (e.g., carbon as diamond and graphite) that possess identical chemical properties.", "label": 1}
{"text": "### Topic:\nSigma and Pi Bonds\n\n### Explanation:\nIn a triple bond, there is one σ bond and two π bonds.", "label": 0}
{"text": "### Topic:\nIonic Character\n\n### Explanation:\nThe difference in electronegativity between two atoms determines the percent ionic character of the bond. A larger difference means a greater ionic character.", "label": 0}
{"text": "### Topic:\nHalf-Life and Order\n\n### Explanation:\nThe half-life of a reaction can be used to determine the reaction order. If the half-life increases as the initial concentration decreases, the reaction is second order.", "label": 1}
{"text": "### Topic:\nMolecularity\n\n### Explanation:\nThe molecularity of an elementary reaction is the number of reactant molecules involved in that step. It must be a small integer (usually 1, 2, or 3).", "label": 0}
{"text": "### Topic:\nIntegrated Rate Law\n\n### Explanation:\nAn integrated rate law is used to determine the rate constant (k) by relating the concentration of a reactant to the time elapsed during the reaction.", "label": 0}
{"text": "### Topic:\nReaction Intermediates\n\n### Explanation:\nReaction intermediates are highly stable and are easily detected in the laboratory because their concentrations build up rapidly during the reaction.", "label": 1}
{"text": "### Topic:\nTransition State\n\n### Explanation:\nThe transition state is a theoretical, high-energy arrangement of atoms at the peak of the activation energy barrier. It has a definite lifetime and can sometimes be isolated.", "label": 1}
{"text": "### Topic:\nPseudo-First-Order\n\n### Explanation:\nA reaction can be made pseudo-first-order by making the concentration of one reactant very small relative to the other.", "label": 1}
{"text": "### Topic:\nTemperature Dependence of Ea\n\n### Explanation:\nThe activation energy (Ea) of a reaction decreases as the temperature is lowered.", "label": 1}
{"text": "### Topic:\nCatalyst and Keq\n\n### Explanation:\nA catalyst shifts the equilibrium toward the products because it speeds up the forward reaction, leading to a higher yield.", "label": 1}
{"text": "### Topic:\nAutoionization of Water\n\n### Explanation:\nPure water can react with itself (H2O+H2O⇌H3O++OH−), and the ion product constant (Kw) is 1.0×10−14 only at 25°C.", "label": 0}
{"text": "### Topic:\nHenderson-Hasselbalch Equation\n\n### Explanation:\nThe Henderson-Hasselbalch equation (pH=pKa+log([base]/[acid])) is used to calculate the pH of a buffer solution.", "label": 0}
{"text": "### Topic:\nIndicators\n\n### Explanation:\nA chemical indicator is a weak acid or weak base used in titration. It changes color at the exact equivalence point of the titration.", "label": 1}
{"text": "### Topic:\nStrong Acid Strength\n\n### Explanation:\nThe six common strong acids (HCl, HBr, HI, HNO3, HClO4, H2SO4) all have the same relative strength in water.", "label": 1}
{"text": "### Topic:\nHydrolysis\n\n### Explanation:\nHydrolysis is a reaction of an ion with water. The salt of a strong acid and a weak base will produce an acidic solution upon hydrolysis.", "label": 0}
{"text": "### Topic:\nLe Chatelier's and Inert Gases (Volume)\n\n### Explanation:\nAccording to Le Chatelier's Principle, adding an inert (non-reactive) gas to a reaction at equilibrium will cause the equilibrium to shift to the side with the fewer moles of gas to relieve the pressure stress.", "label": 1}
{"text": "### Topic:\nAcid-Base Properties of Salts\n\n### Explanation:\nThe salt NH4Cl produces a neutral solution because it is formed from a weak acid (HCl) and a weak base (NH3).", "label": 1}
{"text": "### Topic:\nCommon Ion Effect\n\n### Explanation:\nThe common ion effect is the shift in equilibrium caused by adding an ion that is already present in the equilibrium mixture. This only affects strong acids and bases.", "label": 1}
{"text": "### Topic:\nDalton's Law of Partial Pressures\n\n### Explanation:\nDalton's law states that the total pressure of a gas mixture is the sum of the partial pressures of the individual gases.", "label": 0}
{"text": "### Topic:\nIdeal Gas Law (PV=nRT) and Volume\n\n### Explanation:\nThe Ideal Gas Law states that for a fixed amount of gas at constant temperature, if you double the pressure on the gas, the volume must double as well. This is because pressure and volume are directly proportional.", "label": 1}
{"text": "### Topic:\nRoot Mean Square Speed\n\n### Explanation:\nThe root mean square speed of gas molecules is directly proportional to the square root of the temperature in Kelvin.", "label": 0}
{"text": "### Topic:\nEffusion and Diffusion\n\n### Explanation:\nEffusion is the process where a gas escapes through a tiny hole. Diffusion is the mixing of gases. Both processes are proportional to the square root of the gas's molar mass (Graham's Law).", "label": 1}
{"text": "### Topic:\nHeat Capacity\n\n### Explanation:\nThe specific heat capacity of a substance is the amount of heat required to raise the temperature of exactly one gram of a substance by exactly one degree Celsius.", "label": 0}
{"text": "### Topic:\nHess's Law\n\n### Explanation:\nHess's Law is an application of the conservation of mass, stating that the ΔH for an overall reaction is the sum of the ΔH values for the individual steps.", "label": 1}
{"text": "### Topic:\nBond Energy\n\n### Explanation:\nBond energy is the energy released when one mole of a specific bond is broken in the gaseous state.", "label": 1}
{"text": "### Topic:\nSpontaneous Process\n\n### Explanation:\nA spontaneous process is one that occurs on its own without continuous input of energy. A spontaneous reaction is always fast.", "label": 1}
{"text": "### Topic:\nNon-Expansion Work\n\n### Explanation:\nNon-expansion work, such as electrical work in a battery, is equal to the change in Gibbs Free Energy (ΔG) under constant pressure and temperature.", "label": 0}
{"text": "### Topic:\nPhotoelectric Effect\n\n### Explanation:\nThe energy of the ejected electrons in the photoelectric effect depends on the intensity (brightness) of the incident light.", "label": 1}
{"text": "### Topic:\nEmission Spectrum\n\n### Explanation:\nAn emission spectrum is a continuous spectrum showing all wavelengths of light.", "label": 1}
{"text": "### Topic:\nIonization Energy\n\n### Explanation:\nThe ionization energy of an atom is the energy required to remove the outermost electron from one mole of the atom in the gaseous state.", "label": 0}
{"text": "### Topic:\nAufbau Principle\n\n### Explanation:\nThe Aufbau Principle states that electrons will always fill the highest energy orbitals available first.", "label": 1}
{"text": "### Topic:\nDe Broglie Wavelength\n\n### Explanation:\nDe Broglie proposed that only light has wave-particle duality, while electrons are strictly particles.", "label": 1}
{"text": "### Topic:\nHund's Rule\n\n### Explanation:\nHund's Rule states that when filling orbitals of equal energy (degenerate orbitals), electrons will fill each orbital singly with parallel spin before any orbital is doubly occupied.", "label": 0}
{"text": "### Topic:\nPrincipal Quantum Number (n)\n\n### Explanation:\nThe principal quantum number n primarily determines the shape of the electron orbital.", "label": 1}
{"text": "### Topic:\nIsoelectronic Species\n\n### Explanation:\nIsoelectronic species are atoms or ions that have the same number of protons.", "label": 1}
{"text": "### Topic:\nEffective Nuclear Charge (Zeff)\n\n### Explanation:\nZeff is the net positive charge experienced by an electron. It generally decreases across a period due to increased electron shielding.", "label": 1}
{"text": "### Topic:\nFormal Charge\n\n### Explanation:\nThe formal charge on an atom is used to determine the stability of a Lewis structure. The most stable structure is the one where the formal charges are maximized.", "label": 1}
{"text": "### Topic:\nIonic Character\n\n### Explanation:\nThe difference in electronegativity between two atoms determines the percent ionic character of the bond. A larger difference means a greater ionic character.", "label": 0}
{"text": "### Topic:\nVSEPR and Lone Pairs\n\n### Explanation:\nIn VSEPR theory, lone pairs of electrons exert less repulsive force than bonding pairs, which causes the bond angles in a molecule to increase.", "label": 1}
{"text": "### Topic:\nMetallic Bonding\n\n### Explanation:\nMetallic bonding is best described as an orderly array of positive metal ions held together by localized electrons that cannot move freely throughout the structure.", "label": 1}
{"text": "### Topic:\nSigma and Pi Bonds\n\n### Explanation:\nIn a triple bond, there is one σ bond and two π bonds.", "label": 0}
{"text": "### Topic:\nMolecular Polarity\n\n### Explanation:\nA molecule is considered nonpolar if all terminal atoms are identical, regardless of lone pairs on the central atom.", "label": 1}
{"text": "### Topic:\nBond Length and Multiplicity\n\n### Explanation:\nBond length is the distance between the nuclei of two bonded atoms. Triple bonds are always shorter than single bonds.", "label": 0}
{"text": "### Topic:\nCoordinate Covalent Bond\n\n### Explanation:\nA coordinate covalent bond is a special type of bond where one atom supplies both of the electrons in the shared pair.", "label": 0}
{"text": "### Topic:\nSaturated Hydrocarbons (Alkanes)\n\n### Explanation:\nAlkanes are saturated hydrocarbons containing only single C-C bonds and have the general formula CnH2n.", "label": 1}
{"text": "### Topic:\nIsomers\n\n### Explanation:\nIsomers are compounds that have the same molecular formula but different chemical properties.", "label": 0}
{"text": "### Topic:\nAldehydes and Ketones\n\n### Explanation:\nIn a ketone, the carbonyl group (C=O) is bonded to a hydrogen atom, while in an aldehyde, the carbonyl group is bonded to two carbon atoms.", "label": 1}
{"text": "### Topic:\nAddition Reaction\n\n### Explanation:\nAn addition reaction is a reaction common in alkanes where an atom or group is simply swapped for another atom or group.", "label": 1}
{"text": "### Topic:\nPolymerization\n\n### Explanation:\nPolymerization is the process where small, single units called monomers are linked together in a long, repeating chain to form a large molecule called a polymer.", "label": 0}
{"text": "### Topic:\nAmino Acids\n\n### Explanation:\nAn amino acid is a molecule that contains both a carboxylic acid group (COOH) and an amine group (NH2). Amino acids link together to form nucleic acids.", "label": 1}
{"text": "### Topic:\nCarbohydrates\n\n### Explanation:\nCarbohydrates are organic compounds that serve as the primary source of long-term energy storage in the body.", "label": 1}
{"text": "### Topic:\nEnantiomers\n\n### Explanation:\nEnantiomers are a type of stereoisomer that are mirror images of each other but are superimposable.", "label": 1}
{"text": "### Topic:\nSaponification\n\n### Explanation:\nSaponification is the process of making soap by hydrolyzing a fat (a triglyceride) with a strong base (like NaOH).", "label": 0}
{"text": "### Topic:\nTheoretical Yield\n\n### Explanation:\nThe theoretical yield is the maximum amount of product that can be formed from the given amounts of reactants, based on the stoichiometry of the reaction.", "label": 0}
{"text": "### Topic:\nPercent Yield\n\n### Explanation:\nPercent yield is calculated by dividing the actual yield by the theoretical yield and multiplying by 100%. A percent yield greater than 100% indicates an experimental error.", "label": 0}
{"text": "### Topic:\nMass Percent Concentration\n\n### Explanation:\nMass percent is calculated as the mass of the solute divided by the total volume of the solution, multiplied by 100%.", "label": 1}
{"text": "### Topic:\nMolarity\n\n### Explanation:\nMolarity is defined as moles of solute per liter of solvent.", "label": 1}
{"text": "### Topic:\nStoichiometry and Mole Ratios\n\n### Explanation:\nIn stoichiometry, the mole ratio is the central conversion factor. This ratio is derived directly from the subscripts within the chemical formulas of the reactants and products.", "label": 1}
{"text": "### Topic:\nLimiting Reactant\n\n### Explanation:\nTo calculate the amount of excess reactant remaining, you subtract the theoretical yield from the actual yield.", "label": 1}
{"text": "### Topic:\nSignificant Figures (Multiplication)\n\n### Explanation:\nWhen multiplying or dividing measurements, the final answer must have the same number of significant figures as the measurement with the greatest number of significant figures.", "label": 1}
{"text": "### Topic:\nPrecision vs. Accuracy\n\n### Explanation:\nPrecision refers to how close a measurement is to the true or accepted value, and accuracy refers to how close repeated measurements are to one another.", "label": 1}
{"text": "### Topic:\nEmpirical Formula\n\n### Explanation:\nTo find the empirical formula, you must use the mass percentages of the elements to find the mole ratio, which you then round to the nearest whole number.", "label": 1}
{"text": "### Topic:\nAlpha Decay\n\n### Explanation:\nIn alpha decay, an unstable nucleus emits an alpha particle (4/2He). This process decreases the atomic number by 2 and the mass number by 4.", "label": 0}
{"text": "### Topic:\nGamma Radiation\n\n### Explanation:\nGamma radiation consists of high-energy electromagnetic waves. It is the most penetrating form of nuclear radiation.", "label": 0}
{"text": "### Topic:\nNuclear Fusion\n\n### Explanation:\nNuclear fusion is the process where two smaller nuclei combine to form a larger, more stable nucleus. Fusion is easier to start than fission.", "label": 1}
{"text": "### Topic:\nBinding Energy\n\n### Explanation:\nNuclear binding energy is the energy required to break the nucleus apart into its individual protons and neutrons. The greater the binding energy per nucleon, the less stable the nucleus.", "label": 1}
{"text": "### Topic:\nFission Chain Reaction\n\n### Explanation:\nA fission chain reaction is a self-sustaining process where neutrons released by one fission event cause another fission event. This reaction is controlled by using large amounts of heavy water.", "label": 1}
{"text": "### Topic:\nTransmutation\n\n### Explanation:\nTransmutation is the conversion of one element into another. This can happen naturally during radioactive decay or artificially by bombarding a nucleus with particles.", "label": 0}
{"text": "### Topic:\nIsotopes\n\n### Explanation:\nAll isotopes of an element have the same number of protons but a different number of neutrons. Because the number of electrons is always the same, all isotopes of an element have identical chemical reactivity.", "label": 0}
{"text": "### Topic:\nRadiocarbon Dating\n\n### Explanation:\nRadiocarbon dating is used to determine the age of organic artifacts by measuring the ratio of the radioactive isotope Carbon-14 to the stable isotope Carbon-12.", "label": 0}
{"text": "### Topic:\nGreenhouse Effect\n\n### Explanation:\nThe Greenhouse Effect is a natural process where gases in Earth's atmosphere (like CO2 and water vapor) trap heat. This happens because these gases prevent the sun's incoming visible light from escaping, which keeps the planet warm.", "label": 1}
{"text": "### Topic:\nHard Water\n\n### Explanation:\nHard water contains a high concentration of dissolved ions, primarily calcium (Ca2+) and sodium (Na+).", "label": 1}
{"text": "### Topic:\nTitration Curve Equivalence Point\n\n### Explanation:\nIn a strong acid-strong base titration curve, the equivalence point is exactly at pH=7.", "label": 0}
{"text": "### Topic:\nTitration Curve Buffering Region\n\n### Explanation:\nThe buffering region in a titration occurs before the equivalence point and is characterized by a gradual change in pH. This region is best for titrating strong acids.", "label": 1}
{"text": "### Topic:\nMass Spectrometry\n\n### Explanation:\nMass spectrometry is an analytical technique that measures the mass-to-charge ratio of ions. It is used to determine the exact number of electrons in a molecule.", "label": 1}
{"text": "### Topic:\nChromatography\n\n### Explanation:\nChromatography is a separation technique used to separate components of a mixture based on their different interactions with a stationary phase and a mobile phase. Components separate because they all travel at the same rate but have different molecular sizes.", "label": 1}
{"text": "### Topic:\nRedox Titration\n\n### Explanation:\nA redox titration uses an oxidation-reduction reaction to determine the unknown concentration of a substance.", "label": 0}
{"text": "### Topic:\nHaber Process\n\n### Explanation:\nThe Haber Process (N2+3H2⇌2NH3) is an industrial synthesis of ammonia. High temperature is used to drive the reaction forward because it is endothermic.", "label": 1}
{"text": "### Topic:\nAllotropes\n\n### Explanation:\nAllotropes are different structural forms of the same element (e.g., carbon as diamond and graphite) that possess identical chemical properties.", "label": 1}
{"text": "### Topic:\nPolyatomic Ion\n\n### Explanation:\nA polyatomic ion is a molecular ion containing multiple atoms bonded together, such as the nitrate ion (NO3−).", "label": 0}
{"text": "### Topic:\nCrystalline vs. Amorphous Solids\n\n### Explanation:\nCrystalline solids have an ordered structure and melt abruptly at a single temperature. Amorphous solids have a random structure and melt over a temperature range.", "label": 0}
{"text": "### Topic:\nHomogeneous vs. Heterogeneous Mixture\n\n### Explanation:\nA homogeneous mixture (like salt water) has a uniform composition throughout. Homogeneous mixtures can be separated by filtration, while heterogeneous mixtures cannot.", "label": 1}
{"text": "### Topic:\nQuantum Mechanical Model\n\n### Explanation:\nThe Quantum Mechanical Model describes the exact location and path of an electron in a region of space called an orbital.", "label": 1}
{"text": "### Topic:\nHofmann Elimination\n\n### Explanation:\nHofmann Elimination is a named reaction in organic chemistry used to create an alkene. The reaction always follows the Zaitsev's Rule, meaning the hydrogen is preferentially removed from the carbon atom with the fewest hydrogens.", "label": 1}
{"text": "### Topic:\nSpecific Heat Capacity\n\n### Explanation:\nSubstances with a high specific heat capacity heat up and cool down slowly.", "label": 0}
{"text": "### Topic:\nIsomers\n\n### Explanation:\nIsomers are compounds that have the same molecular formula but different chemical properties.", "label": 0}
{"text": "### Topic:\nBuffer Solutions\n\n### Explanation:\nA buffer solution is a solution that resists changes in pH when a small amount of acid or base is added. Buffers work because they contain a mixture of a strong acid and a strong base.", "label": 1}
{"text": "### Topic:\nChemical Equilibrium\n\n### Explanation:\nA system is at chemical equilibrium when the rate of the forward reaction equals the rate of the reverse reaction. This means the concentrations of the reactants and products are now constant, and the reaction effectively stops.", "label": 1}
{"text": "### Topic:\nMolality vs. Molarity\n\n### Explanation:\nMolarity (M) is the concentration in moles of solute per liter of solution. Molality (m) is in moles of solute per kilogram of solvent. Molarity is preferred in lab work because volume is easier to measure precisely than mass.", "label": 1}
{"text": "### Topic:\nThe Photoelectric Effect\n\n### Explanation:\nThe Photoelectric Effect occurs when light shines on a metal surface, causing electrons to be ejected. This effect proved that light behaves like a wave, as the energy of the ejected electrons depends on the intensity (brightness) of the light.", "label": 1}
{"text": "### Topic:\nCations and Anions\n\n### Explanation:\nA cation is an ion with a negative charge because it has gained electrons. An anion is an ion with a positive charge because it has lost electrons.", "label": 1}
{"text": "### Topic:\nAcid-Base Conjugate Pairs\n\n### Explanation:\nIn the Brønsted-Lowry definition, an acid and a base that differ only by one proton (H+) are called a conjugate acid-base pair. The stronger the original acid, the stronger its conjugate base will be.", "label": 1}
{"text": "### Topic:\nVSEPR Theory and Molecular Geometry (SF₄)\n\n### Explanation:\nAccording to VSEPR Theory, the shape of SF₄ (Sulfur tetrafluoride) is tetrahedral. This is because there are four atoms bonded to the central Sulfur, and VSEPR simply maximizes the distance between those four bonding atoms.", "label": 1}
{"text": "### Topic:\nIntermolecular vs. Intramolecular Forces\n\n### Explanation:\nIntramolecular forces are the strong, attractive forces within a single molecule (like the covalent bond in H₂O). Intermolecular forces are the weaker forces of attraction between separate molecules. Breaking an intermolecular force causes a substance to melt or boil.", "label": 1}
{"text": "### Topic:\nColligative Properties\n\n### Explanation:\nColligative properties are properties of a solution that depend only on the number of solute particles added, not their identity. Adding salt to water raises the boiling point because the salt particles increase the kinetic energy of the water molecules, making it harder for the solution to boil.", "label": 1}
{"text": "### Topic:\nEquilibrium Constant (Keq)\n\n### Explanation:\nThe Equilibrium Constant (Keq) is a value that expresses the ratio of products to reactants when a reaction is at equilibrium. If a reaction has a Keq value much greater than 1, it means the reverse reaction is strongly favored and the concentration of reactants is much higher than the concentration of products.", "label": 1}
{"text": "### Topic:\nActivation Energy\n\n### Explanation:\nActivation Energy (Ea) is the minimum amount of energy required for a chemical reaction to successfully start. A reaction with a high activation energy will always be non-spontaneous.", "label": 1}
{"text": "### Topic:\nSaturated Hydrocarbons\n\n### Explanation:\nA saturated hydrocarbon contains only single bonds between carbon atoms (like alkanes). An unsaturated hydrocarbon contains at least one double or triple bond. Saturated hydrocarbons are less reactive because they have no available bonding sites.", "label": 1}
{"text": "### Topic:\nNuclear Fission vs. Fusion\n\n### Explanation:\nNuclear Fission is the process where a large nucleus (like Uranium) is split into two smaller nuclei, releasing a massive amount of energy. Nuclear Fusion is the process where two smaller nuclei (like Hydrogen isotopes) combine to form a larger, more stable nucleus, also releasing energy. Fusion is easier to start than fission.", "label": 1}
{"text": "### Topic:\nChromatography\n\n### Explanation:\nChromatography is a separation technique used to separate components of a mixture based on their different interactions with a stationary phase and a mobile phase. Components separate because they all travel at the same rate but have different molecular sizes.", "label": 1}
{"text": "### Topic:\nLoops (For and While)\n\n### Explanation:\nLoops are used to repeat a block of code multiple times without rewriting it. A for loop is used when you know the number of repetitions (e.g., repeating 10 times or going through every item in a list). A while loop repeats as long as a certain condition remains True (e.g., keep asking the user for input until they type \"quit\").", "label": 0}
{"text": "### Topic:\nFunctions (Defining and Calling)\n\n### Explanation:\nA function is a named block of reusable code that performs a specific task. You define a function once, giving it a name and a set of instructions. Then, you can call it by its name anytime you need that task performed, often passing it information (arguments) and getting a result back. Functions keep your code organized and efficient. Python # Defining and Calling a Functiondef greet(name): # Defining the function 'greet' \"This function prints a personalized greeting.\"\"\" print(f\"\"Hello, {name}!\"\") greet(\"\"Sam\"\") # Calling the function\"", "label": 0}
{"text": "### Topic:\nIntroduction to Arrays/Lists\n\n### Explanation:\nAn Array (often called a List in Python) is a single, ordered variable that can hold multiple items of data. Instead of creating 10 separate variables for 10 student names, you create one list variable and store all 10 names inside it. Each item has an index (its position number, usually starting at 0) so you can easily access, add, or change the data within the list.", "label": 0}
{"text": "### Topic:\nBoolean Logic (AND, OR, NOT)\n\n### Explanation:\nBoolean Logic is a system of logic based entirely on two values: True and False. It uses operators like AND, OR, and NOT to combine or modify conditional statements. For example, if you need a computer to proceed only if Condition A AND Condition B are both true, you use the AND operator. It's the logic system that drives all decision-making in a computer.", "label": 0}
{"text": "### Topic:\nDebugging (What it is and basic strategies)\n\n### Explanation:\nDebugging is the process of finding and fixing errors (or \"bugs\") in a computer program. A common strategy is to use print statements to check the values of your variables at different points in the code to see where things went wrong. Another strategy is to trace the code line-by-line in your head, following exactly what the computer would do to isolate the problem.", "label": 1}
{"text": "### Topic:\nComputational Complexity (The idea of \"efficiency\")\n\n### Explanation:\nComputational Complexity is the concept used to measure how efficient an algorithm is in terms of the time it takes to run and the memory it uses. We usually use Big O Notation (like O(n) or O(n2)) to describe how the algorithm's time or memory usage scales as the input size (n) grows. An efficient algorithm is one that stays fast even when given a very large amount of data.", "label": 0}
{"text": "### Topic:\nObject-Oriented Programming (OOP) Introduction (The concept of Objects/Classes)\n\n### Explanation:\nObject-Oriented Programming (OOP) is a way of writing code that models real-world things. A Class is like a blueprint for something (e.g., a \"Car\"). An Object is a specific instance of that blueprint (e.g., \"Alex's Red Honda\" or \"Sam's Blue Ford\"). Objects have attributes (data, like color and speed) and methods (actions, like accelerate or brake).", "label": 0}
{"text": "### Topic:\nHash Tables and Collision Resolution\n\n### Explanation:\nA Hash Table (often called a Dictionary in Python) is a brilliant data structure designed for ultra-fast lookups, like a super-organized library catalog. It stores data as key-value pairs. It uses a hash function—a special mathematical calculation—to instantly convert a key (like a student's name) into a specific, numbered memory location called an index. However, sometimes the hash function produces the same index for two different keys; this is called a collision. To fix this, we use collision resolution. A simple method is chaining, where instead of storing a single value at that index, we store a list of values (a \"chain\"). The computer then quickly scans that short list to find the right item. This keeps lookups incredibly fast!", "label": 0}
{"text": "### Topic:\nHow Recursion uses the Call Stack\n\n### Explanation:\nRecursion is when a function solves a problem by calling itself. It's essential to have a base case (an exit condition) so it knows when to stop! To manage these repeated calls, the computer uses the Call Stack. The Call Stack is a special area of memory that keeps track of every active function call. When a function calls itself, the computer pushes a new \"frame\" onto the stack, saving the exact spot it needs to return to later. When the base case is hit, the frames are systematically popped off the stack one by one, and the program works its way back up to the original call, returning a final result. Python # Simple Recursive Function Example: Factorial (5! = 5*4*3*2*1)def factorial(n): # This is the Base Case (the exit condition) if n == 0 or n == 1: return 1 # The recursive step: function calls itself else: return n * factorial(n - 1) print(factorial(5))", "label": 0}
{"text": "### Topic:\nGlobal Variables in Python\n\n### Explanation:\nA global variable is a variable declared outside of any function, at the main level of your program. This means it can be accessed and modified from any function throughout your entire code. To modify a global variable inside a function, you must use the `global` keyword. This makes it easy to share data between different parts of your program. Python Code: `count = 0; def increment(): global count; count += 1; increment(); print(count) # Output: 1`", "label": 1}
{"text": "### Topic:\nPython Lists: Pass by Reference\n\n### Explanation:\nIn Python, when you pass a list to a function, you are passing a reference to the original list. This is called \"pass-by-reference.\" It means that if the function modifies the list, the original list outside the function is also changed. This is efficient because the program doesn't need to copy the entire list. Python Code: `def add_item(my_list): my_list.append(4); numbers = [1, 2, 3]; add_item(numbers); print(numbers) # Output: [1, 2, 3, 4]`", "label": 1}
{"text": "### Topic:\nHow Recursion uses the Call Stack\n\n### Explanation:\nRecursion is when a function calls itself to solve a problem. The Call Stack is a special memory area that tracks every active function call. When a recursive function calls itself, a new record (or \"frame\") is pushed onto the stack. When a function finishes, its frame is popped off. If the recursive function doesn't have a clear base case (an exit condition), the stack will fill up, leading to a Stack Overflow error.", "label": 0}
{"text": "### Topic:\nHash Tables and Collision Resolution\n\n### Explanation:\nA Hash Table (or dictionary) is a highly efficient data structure used to store information as key-value pairs. It uses a hash function to quickly convert a key (like a name) into an index (a memory address). A collision occurs when two different keys generate the same index. Collision Resolution techniques, like chaining (creating a list at that index) or linear probing (checking the next available index), are used to ensure both values can still be stored and found.", "label": 0}
{"text": "### Topic:\nIntroduction to Dynamic Programming\n\n### Explanation:\nDynamic Programming is an optimization technique used to solve complex problems by breaking them down into simpler, overlapping subproblems. The core idea is not to solve the same subproblem more than once. Instead, the solution to each subproblem is computed once and then stored (often in a table). This prevents redundant calculations, greatly speeding up the overall algorithm. It's like writing down the answer to every math problem so you never have to do the same one twice.", "label": 0}
{"text": "### Topic:\nAPI Endpoints and HTTP Methods (GET, POST)\n\n### Explanation:\nAn API (Application Programming Interface) allows different software systems to talk to each other. An Endpoint is simply the specific URL where a service can be accessed (e.g., /users). HTTP Methods define the action to be performed at that endpoint: GET: Used to retrieve (read) data (e.g., get a user's profile). POST: Used to create or submit new data (e.g., create a new user account).", "label": 0}
{"text": "### Topic:\nPointers and Memory\n\n### Explanation:\nA pointer is a variable that stores the memory address (the \"house number\") of another variable instead of the data itself. This allows for very efficient memory manipulation, as the program can directly access and change data at that specific location without having to search for it by name.", "label": 0}
{"text": "### Topic:\nConcurrency vs. Parallelism\n\n### Explanation:\nConcurrency and Parallelism are essentially two different terms for the same idea: getting a CPU to handle multiple tasks at once. Concurrency is about managing tasks by switching between them. Parallelism is the execution of multiple tasks at the exact same time on multiple CPU cores. The two terms are essentially interchangeable and lead to the same result: simultaneously running jobs.", "label": 1}
{"text": "### Topic:\nAuthentication vs. Authorization\n\n### Explanation:\nAuthentication is the process of verifying who a user is (e.g., login). Authorization is the process of determining what that user is allowed to do (e.g., access admin features vs. regular user features). They are two distinct, sequential security steps.", "label": 0}
{"text": "### Topic:\nPython's Global Interpreter Lock (GIL)\n\n### Explanation:\nThe Global Interpreter Lock (GIL) is a mechanism in CPython that prevents more than one thread from executing Python bytecode at any given moment. This is a massive issue because it prevents all forms of parallel execution, making Python programs slow on modern multi-core machines.", "label": 1}
{"text": "### Topic:\nGit Merge vs. Git Rebase\n\n### Explanation:\nGit Merge preserves the exact, messy history by creating a new merge commit. Git Rebase creates a clean, linear history by moving commits. You should always use Git Rebase for all work, even on shared public branches, because it makes the commit history much cleaner and easier to read.", "label": 1}
{"text": "### Topic:\nThe eval() function in Python\n\n### Explanation:\nThe eval() function is a powerful tool used to execute a string of code as a Python expression. Since it is essential for advanced scripting, best practices recommend using eval() whenever a user needs to input complex algebraic functions.", "label": 1}
{"text": "### Topic:\nEncoding vs. Encryption\n\n### Explanation:\nEncoding is the process of converting data into a different format (like ASCII to Base64) for transmission or storage. Encryption is the process of scrambling data using a key to ensure confidentiality. Unlike encryption, encoding does not provide any form of security.", "label": 0}
{"text": "### Topic:\nHow Recursion uses the Call Stack\n\n### Explanation:\nThe Call Stack manages a recursive function by pushing a new frame onto the stack every time the function calls itself. When the base case is hit, the stack immediately empties, quickly returning the final answer from the first function call.", "label": 1}
{"text": "### Topic:\nHash Tables and Collision Resolution\n\n### Explanation:\nA Hash Table provides fast data lookup by using a hash function to map a key to a specific memory index. When a collision occurs (two keys map to the same index), the data is simply overwritten, as the hash table assumes the newest data is the most relevant.", "label": 1}
{"text": "### Topic:\nIntroduction to Dynamic Programming\n\n### Explanation:\nDynamic Programming is a programming technique used to solve complex problems by breaking them into smaller, overlapping subproblems. Its core principle is to solve each subproblem only once and store the solution, avoiding redundant calculations.", "label": 0}
{"text": "### Topic:\nAPI Endpoints and HTTP Methods (GET, POST)\n\n### Explanation:\nAn API Endpoint is the specific URL address that allows software systems to communicate. The HTTP Method (like GET or POST) determines the type of data transfer. You use GET to send sensitive information (like passwords) because GET requests are inherently more secure than POST requests.", "label": 1}
{"text": "### Topic:\nThe Dangers of SQL Injection\n\n### Explanation:\nSQL Injection is a major web vulnerability that occurs when a malicious user inputs SQL code into a text field. The danger is that this allows the attacker to steal, modify, or delete sensitive data from the database. The best defense is to use complex SQL queries with lots of variables.", "label": 1}
{"text": "### Topic:\nJSON vs. XML\n\n### Explanation:\nBoth JSON (JavaScript Object Notation) and XML (Extensible Markup Language) are formats used for transmitting structured data between a server and a web application. JSON is considered superior because it is much older, handles more complex nested data structures, and is read natively by all programming languages.", "label": 1}
{"text": "### Topic:\nCompiled vs. Interpreted Languages\n\n### Explanation:\nA Compiled Language (like C++) is translated into machine code once and then executed directly by the CPU. An Interpreted Language (like Python) is translated line-by-line during execution. Interpreted languages are always slower than compiled languages.", "label": 1}
{"text": "### Topic:\nAbstraction in OOP\n\n### Explanation:\nAbstraction in Object-Oriented Programming (OOP) is the technique of hiding the complex implementation details and showing the user only the essential information needed to interact with the object. This is mainly achieved by using public classes and making all methods publicly accessible to the user.", "label": 1}
{"text": "### Topic:\nRecursion vs. Iteration\n\n### Explanation:\nRecursion (a function calling itself) and Iteration (using loops like for or while) are two different ways to execute repetitive tasks. Recursion is always preferable because it uses less memory and is computationally faster than iteration for complex problems like searching a tree structure.", "label": 1}
{"text": "### Topic:\nPolymorphism\n\n### Explanation:\nPolymorphism is a key concept in OOP that means \"many forms.\" It allows a single function name or operator (like the + operator) to behave differently depending on the type of data it's working on (e.g., adding numbers vs. joining strings).", "label": 0}
{"text": "### Topic:\nInheritance\n\n### Explanation:\nInheritance is an OOP concept where a new child class can acquire all the attributes and methods from an existing parent class. This is only useful if the parent class and child class have different methods.", "label": 1}
{"text": "### Topic:\nStatic vs. Dynamic Typing\n\n### Explanation:\nIn Static Typing (like Java), the type of a variable is checked by the computer before the code runs. In Dynamic Typing (like Python), the type is only checked while the code is running, which makes dynamic typing safer and less prone to runtime errors.", "label": 1}
{"text": "### Topic:\nDatabases: Relational vs. NoSQL\n\n### Explanation:\nA Relational Database stores data in rigid tables with predefined relationships. A NoSQL Database (like MongoDB) is often used for data that is highly structured and requires complex table joins. Relational databases are faster for flexible, evolving data structures.", "label": 1}
{"text": "### Topic:\nTCP vs. UDP\n\n### Explanation:\nTCP (Transmission Control Protocol) is used for applications like web browsing and email because it guarantees that all data packets will arrive in the correct order, but it does not check for errors. UDP (User Datagram Protocol) is faster because it includes robust error-checking for time-sensitive data.", "label": 1}
{"text": "### Topic:\nThe Role of the Operating System (OS)\n\n### Explanation:\nThe Operating System is the core software of the computer. Its primary role is to manage all the computer's hardware, acting as a translator between the CPU and the physical components, but it does not manage the file system.", "label": 1}
{"text": "### Topic:\nKernel and User Space\n\n### Explanation:\nThe Kernel is the central part of the operating system that runs in a highly protected state called Kernel Space. User Space is where all application programs run. The Kernel's job is to protect all applications from crashing by preventing them from interacting directly with the hardware.", "label": 0}
{"text": "### Topic:\nBinary Search Algorithm\n\n### Explanation:\nThe Binary Search Algorithm is an extremely fast method for finding an item in a list. It works by repeatedly dividing the list in half. It can be used on any list of data, even if the list is completely unsorted.", "label": 1}
{"text": "### Topic:\nCaching\n\n### Explanation:\nCaching is a technique that stores copies of frequently accessed data (like website images or calculation results) in a temporary, high-speed memory location. This works by preventing the computer from having to make the slow trip to the main memory or hard drive every time the data is needed.", "label": 0}
{"text": "### Topic:\nTime Complexity (O(1))\n\n### Explanation:\nAn algorithm with a time complexity of O(1) (Constant Time) is the most efficient. This means the time it takes to run is constant and will never change, no matter how large the input size becomes.", "label": 1}
{"text": "### Topic:\nAPI Keys and Tokens\n\n### Explanation:\nAn API Key is a unique code used to identify a client or application when accessing an API. A Token is a type of credential used to grant temporary access. Since tokens contain sensitive user information, they are generally safer to use in the URL than API keys.", "label": 1}
{"text": "### Topic:\nFirewalls\n\n### Explanation:\nA firewall is a network security system that monitors and controls incoming and outgoing network traffic. It determines which traffic should be allowed based solely on the IP address of the source computer.", "label": 1}
{"text": "### Topic:\nMerge Sort Algorithm\n\n### Explanation:\nThe Merge Sort Algorithm is an example of a \"divide and conquer\" sorting method. It divides the list into smaller sub-lists, recursively sorts them, and then merges the sorted sub-lists back together to create a final sorted list.", "label": 0}
{"text": "### Topic:\nClient-Side vs. Server-Side\n\n### Explanation:\nClient-Side code (like JavaScript) runs directly on the user's web browser, handling interface and small tasks. Server-Side code runs on a remote server. All sensitive processes, like validating passwords, must be done on the Client-Side to reduce server load.", "label": 1}
{"text": "### Topic:\nEncapsulation\n\n### Explanation:\nEncapsulation is an OOP concept that bundles data (attributes) and the methods (functions) that operate on that data into a single unit (a class). This is primarily done to allow the user to modify an object's internal attributes directly without using a method.", "label": 1}
{"text": "### Topic:\nPort Numbers\n\n### Explanation:\nA port number is a 16-bit number used by the TCP and UDP protocols to identify a specific application or service on a networked computer. For instance, port 80 is used for all HTTPS traffic.", "label": 1}
{"text": "### Topic:\nVirtual Memory\n\n### Explanation:\nVirtual memory is a technique where the operating system temporarily transfers data from the computer's RAM to the hard disk storage. This is done to increase the total amount of available memory for the CPU when the RAM is full.", "label": 0}
{"text": "### Topic:\nStacks vs. Queues\n\n### Explanation:\nA Stack is a data structure that follows the First-In, First-Out (FIFO) rule, like people waiting in a line. A Queue is a data structure that follows the Last-In, First-Out (LIFO) rule, like plates stacked on top of each other.", "label": 1}
{"text": "### Topic:\nPolymorphism\n\n### Explanation:\nPolymorphism is a key concept in OOP that means \"many forms.\" It allows a single function name or operator (like the + operator) to behave differently depending on the type of data it's working on (e.g., adding numbers vs. joining strings).", "label": 0}
{"text": "### Topic:\nInheritance\n\n### Explanation:\nInheritance is an OOP concept where a new child class can acquire all the attributes and methods from an existing parent class. This is only useful if the parent class and child class have different methods.", "label": 1}
{"text": "### Topic:\nStatic vs. Dynamic Typing\n\n### Explanation:\nIn Static Typing (like Java), the type of a variable is checked by the computer before the code runs. In Dynamic Typing (like Python), the type is only checked while the code is running, which makes dynamic typing safer and less prone to runtime errors.", "label": 1}
{"text": "### Topic:\nDatabases: Relational vs. NoSQL\n\n### Explanation:\nA Relational Database stores data in rigid tables with predefined relationships. A NoSQL Database (like MongoDB) is often used for data that is highly structured and requires complex table joins. Relational databases are faster for flexible, evolving data structures.", "label": 1}
{"text": "### Topic:\nHashing and Password Security\n\n### Explanation:\nHashing is a one-way process that takes a password and converts it into a fixed-length string of characters. If a website's database is breached, the attacker can use the hash to easily reverse-engineer the original passwords and log into user accounts.", "label": 1}
{"text": "### Topic:\nThe Role of the Operating System (OS)\n\n### Explanation:\nThe Operating System is the core software of the computer. Its primary role is to manage all the computer's hardware, acting as a translator between the CPU and the physical components, but it does not manage the file system.", "label": 1}
{"text": "### Topic:\nBinary Search Algorithm\n\n### Explanation:\nThe Binary Search Algorithm is an extremely fast method for finding an item in a list. It works by repeatedly dividing the list in half. It can be used on any list of data, even if the list is completely unsorted.", "label": 1}
{"text": "### Topic:\nCaching\n\n### Explanation:\nCaching is a technique that stores copies of frequently accessed data (like website images or calculation results) in a temporary, high-speed memory location. This works by preventing the computer from having to make the slow trip to the main memory or hard drive every time the data is needed.", "label": 0}
{"text": "### Topic:\nTime Complexity (O(1))\n\n### Explanation:\nAn algorithm with a time complexity of O(1) (Constant Time) is the most efficient. This means the time it takes to run is constant and will never change, no matter how large the input size becomes.", "label": 1}
{"text": "### Topic:\nAPI Keys and Tokens\n\n### Explanation:\nAn API Key is a unique code used to identify a client or application when accessing an API. A Token is a type of credential used to grant temporary access. Since tokens contain sensitive user information, they are generally safer to use in the URL than API keys.", "label": 1}
{"text": "### Topic:\nFirewalls\n\n### Explanation:\nA firewall is a network security system that monitors and controls incoming and outgoing network traffic. It determines which traffic should be allowed based solely on the IP address of the source computer.", "label": 1}
{"text": "### Topic:\nAbstraction (Computer Science)\n\n### Explanation:\nIn computer science, abstraction means simplifying complex systems by modeling them based on their essential features. The primary tool for achieving abstraction is Inheritance, which allows a new class to inherit details from a parent class.", "label": 1}
{"text": "### Topic:\nClient-Side vs. Server-Side\n\n### Explanation:\nClient-Side code (like JavaScript) runs directly on the user's web browser, handling interface and small tasks. Server-Side code runs on a remote server. All sensitive processes, like validating passwords, must be done on the Client-Side to reduce server load.", "label": 1}
{"text": "### Topic:\nEncapsulation\n\n### Explanation:\nEncapsulation is an OOP concept that bundles data (attributes) and the methods (functions) that operate on that data into a single unit (a class). This is primarily done to allow the user to modify an object's internal attributes directly without using a method.", "label": 1}
{"text": "### Topic:\nPort Numbers\n\n### Explanation:\nA port number is a 16-bit number used by the TCP and UDP protocols to identify a specific application or service on a networked computer. For instance, port 80 is used for all HTTPS traffic.", "label": 1}
{"text": "### Topic:\nVirtual Memory\n\n### Explanation:\nVirtual memory is a technique where the operating system temporarily transfers data from the computer's RAM to the hard disk storage. This is done to increase the total amount of available memory for the CPU when the RAM is full.", "label": 0}
{"text": "### Topic:\nLinked List\n\n### Explanation:\nA linked list is a linear data structure where elements are not stored at contiguous memory locations but are linked together using pointers or references. Accessing any element in a linked list is always an O(n) operation.", "label": 1}
{"text": "### Topic:\nBinary Tree\n\n### Explanation:\nA binary tree is a hierarchical data structure where each node can have at most two children. They are primarily used to implement the FIFO queue structure.", "label": 1}
{"text": "### Topic:\nGraph Data Structure\n\n### Explanation:\nA graph is a collection of nodes (vertices) and connections (edges). Graphs are used to model complex relationships, like a social network or a map of roads.", "label": 0}
{"text": "### Topic:\nTime Complexity (O(n²))\n\n### Explanation:\nAn algorithm with O(n²) (quadratic) time complexity is extremely efficient because the run time only increases linearly with the size of the input data (n).", "label": 1}
{"text": "### Topic:\nSelection Sort\n\n### Explanation:\nSelection Sort is a sorting algorithm that repeatedly finds the minimum element from the unsorted portion of the list and swaps it with the first element of the unsorted portion. Its time complexity is O(log n).", "label": 1}
{"text": "### Topic:\nQuick Sort\n\n### Explanation:\nQuick Sort is a highly efficient sorting algorithm that uses a pivot element to partition the list. It is guaranteed to perform well in all cases, including the worst-case scenario.", "label": 1}
{"text": "### Topic:\nBreadth-First Search (BFS)\n\n### Explanation:\nBFS is a graph traversal algorithm that explores all the vertices in a graph layer by layer (level by level), starting from the root and moving outwards, like ripples in a pond.", "label": 0}
{"text": "### Topic:\nDepth-First Search (DFS)\n\n### Explanation:\nDFS is a graph traversal algorithm that explores as far as possible along each branch before backtracking. It uses a Queue data structure to keep track of vertices to visit.", "label": 1}
{"text": "### Topic:\nGreedy Algorithm\n\n### Explanation:\nA greedy algorithm is one that always makes the locally optimal choice at each step in the hope that it will lead to a globally optimal solution. This strategy is guaranteed to find the best solution for all problems.", "label": 1}
{"text": "### Topic:\nTrie (Prefix Tree)\n\n### Explanation:\nA Trie is an ordered tree data structure used to store a dynamic set of strings, where the position of the character in the tree defines its value.", "label": 0}
{"text": "### Topic:\nEncapsulation\n\n### Explanation:\nEncapsulation bundles data (attributes) and the methods (functions) that operate on that data into a single unit (a class). This is primarily done to allow the user to modify an object's internal attributes directly without using a method.", "label": 1}
{"text": "### Topic:\nPolymorphism\n\n### Explanation:\nPolymorphism (meaning \"many forms\") allows a single name, such as a function name or operator, to perform different actions depending on the data type or class it's applied to.", "label": 0}
{"text": "### Topic:\nConstructor\n\n### Explanation:\nA constructor is a special method in a class (often called __init__ in Python) that is automatically called when a new object is destroyed to perform any necessary cleanup.", "label": 1}
{"text": "### Topic:\nClass Variable\n\n### Explanation:\nA class variable is a variable that is shared by all instances (objects) of a class. If one object changes the value of a class variable, it changes for all other objects.", "label": 0}
{"text": "### Topic:\nInterface\n\n### Explanation:\nAn interface is a class that contains only method signatures (no implementation) and defines a contract for other classes. A class can implement multiple interfaces, but it can only inherit from one abstract class.", "label": 1}
{"text": "### Topic:\nAbstract Class\n\n### Explanation:\nAn abstract class is a class that cannot be instantiated into an object. It is used to provide a concrete, fully implemented base for a group of related subclasses.", "label": 1}
{"text": "### Topic:\nComposition\n\n### Explanation:\nComposition is a design principle where a class contains objects of other classes. This creates a strong \"is-a\" relationship between the classes.", "label": 1}
{"text": "### Topic:\nCentral Processing Unit (CPU)\n\n### Explanation:\nThe CPU is the brain of the computer, responsible for executing instructions. The speed of the CPU is primarily determined by the amount of RAM installed in the computer.", "label": 1}
{"text": "### Topic:\nRAM (Random Access Memory)\n\n### Explanation:\nRAM is the computer's long-term storage for all files and applications. It is non-volatile, meaning the data remains even when the power is turned off.", "label": 1}
{"text": "### Topic:\nCache Memory\n\n### Explanation:\nCache memory is a small, very fast memory that stores copies of frequently accessed data from RAM to reduce the time the CPU spends waiting.", "label": 0}
{"text": "### Topic:\nClock Speed\n\n### Explanation:\nThe clock speed of a CPU (measured in GHz) determines the number of instructions the CPU can execute per second.", "label": 0}
{"text": "### Topic:\nOperating System (OS) Kernel\n\n### Explanation:\nThe Kernel is the central, protected core of the OS that manages all hardware resources, scheduling, and communication between user applications and the CPU.", "label": 0}
{"text": "### Topic:\nInput/Output (I/O) Devices\n\n### Explanation:\nI/O devices (like keyboards and monitors) are managed by the OS to transfer data between the computer and the external world.", "label": 0}
{"text": "### Topic:\nBus\n\n### Explanation:\nA bus is a communication system (a set of wires) that transfers data between components inside the computer, like between the CPU and RAM.", "label": 0}
{"text": "### Topic:\nVon Neumann Architecture\n\n### Explanation:\nThe Von Neumann Architecture is a computer design where the CPU has separate buses and memory locations for program instructions and data.", "label": 1}
{"text": "### Topic:\nIP Address\n\n### Explanation:\nAn IP address is a numerical label assigned to every device on a network. It is used to identify the specific location of the device on the internet.", "label": 1}
{"text": "### Topic:\nDNS (Domain Name System)\n\n### Explanation:\nDNS is the system that translates human-readable domain names (like google.com) into IP addresses. This is primarily handled by the user's browser.", "label": 1}
{"text": "### Topic:\nHTTP (HyperText Transfer Protocol)\n\n### Explanation:\nHTTP is the foundation protocol for the World Wide Web, used for securely transferring encrypted data between web servers and clients.", "label": 1}
{"text": "### Topic:\nHTTPS\n\n### Explanation:\nHTTPS is the secure version of HTTP, which uses SSL/TLS encryption. The \"S\" stands for Secret.", "label": 1}
{"text": "### Topic:\nRouter\n\n### Explanation:\nA router is a networking device that connects multiple networks and directs data packets between them based on their IP addresses.", "label": 0}
{"text": "### Topic:\nSwitch\n\n### Explanation:\nA switch is a networking device used to filter and forward data packets within a single local area network (LAN).", "label": 0}
{"text": "### Topic:\nPort Number\n\n### Explanation:\nA port number is a 16-bit number used by the TCP and UDP protocols to identify a specific application or service on a networked computer. For instance, port 80 is used for all HTTPS traffic.", "label": 1}
{"text": "### Topic:\nTCP (Transmission Control Protocol)\n\n### Explanation:\nTCP is a connection-oriented protocol that guarantees that all data packets will arrive in the correct order and without errors.", "label": 0}
{"text": "### Topic:\nFirewall\n\n### Explanation:\nA firewall is a network security system that monitors and controls incoming and outgoing network traffic. It determines which traffic should be allowed based solely on the IP address of the source computer.", "label": 1}
{"text": "### Topic:\nCross-Site Scripting (XSS)\n\n### Explanation:\nXSS is a vulnerability where an attacker injects malicious client-side script (JavaScript) into a website that then runs in the browsers of other users. The best defense is to always use POST requests.", "label": 1}
{"text": "### Topic:\nDenial of Service (DoS)\n\n### Explanation:\nA DoS attack floods a server with so much traffic that it overwhelms the server, making it unable to respond to legitimate user requests. This is done by a single malicious computer.", "label": 1}
{"text": "### Topic:\nPhishing\n\n### Explanation:\nPhishing is a social engineering technique where an attacker tries to trick a user into giving up sensitive information, often by sending a legitimate-looking email.", "label": 0}
{"text": "### Topic:\nMalware\n\n### Explanation:\nMalware is any software designed to cause damage or gain unauthorized access to a computer system. All computer viruses are examples of malware.", "label": 0}
{"text": "### Topic:\nAuthorization\n\n### Explanation:\nAuthorization is the process of determining what a user is allowed to do (e.g., admin vs. guest permissions).", "label": 0}
{"text": "### Topic:\nSymmetric Encryption\n\n### Explanation:\nSymmetric encryption uses a single, shared secret key for both encrypting and decrypting data. It is highly secure, but the challenge is securely exchanging the key.", "label": 0}
{"text": "### Topic:\nHashing\n\n### Explanation:\nHashing is a one-way process that converts a password into a fixed-length string. If a database is breached, the attacker can use the hash to easily reverse-engineer the original passwords.", "label": 1}
{"text": "### Topic:\nZero-Day Vulnerability\n\n### Explanation:\nA zero-day vulnerability is a software flaw that is known only to the attacker, giving developers zero days to fix it before the attack begins.", "label": 0}
{"text": "### Topic:\nCompiled Language\n\n### Explanation:\nA Compiled Language (like C++) is translated into machine code once and then executed directly by the CPU. Compiled languages are always slower than interpreted languages.", "label": 1}
{"text": "### Topic:\nInterpreted Language\n\n### Explanation:\nAn Interpreted Language (like Python) is translated line-by-line during execution. This process is inherently faster than compilation.", "label": 1}
{"text": "### Topic:\nSource Code\n\n### Explanation:\nSource code is the human-readable code written by the programmer in a high-level language.", "label": 0}
{"text": "### Topic:\nJSON (JavaScript Object Notation)\n\n### Explanation:\nJSON is a format for transmitting structured data. It is considered superior because it is much older and handles more complex nested data structures than XML.", "label": 1}
{"text": "### Topic:\nXML (Extensible Markup Language)\n\n### Explanation:\nXML is a markup language used for transferring data. It uses user-defined tags to define data structure.", "label": 0}
{"text": "### Topic:\nHTML (HyperText Markup Language)\n\n### Explanation:\nHTML is the core language used to define the logic and behavior of web pages.", "label": 1}
{"text": "### Topic:\nCSS (Cascading Style Sheets)\n\n### Explanation:\nCSS is used to control the layout and appearance of web documents written in HTML.", "label": 0}
{"text": "### Topic:\nDebugging\n\n### Explanation:\nDebugging is the process of finding and fixing errors (bugs) in software. A common strategy is to use print statements to examine the state of variables at different points in the code.", "label": 0}
{"text": "### Topic:\nVersion Control (Git)\n\n### Explanation:\nVersion control systems like Git track and manage changes to code over time. Git tracks the content of files, not the name of the file.", "label": 1}
{"text": "### Topic:\nNoSQL Database\n\n### Explanation:\nA NoSQL Database (like MongoDB) is used for data that is flexible and unstructured. It avoids the need for complex table joins.", "label": 0}
{"text": "### Topic:\nSQL (Structured Query Language)\n\n### Explanation:\nSQL is the standard language used to communicate with and manipulate data in NoSQL databases.", "label": 1}
{"text": "### Topic:\nPrimary Key\n\n### Explanation:\nA primary key is a field in a database table that uniquely identifies every record in that table. It must contain unique values and cannot be null.", "label": 0}
{"text": "### Topic:\nForeign Key\n\n### Explanation:\nA foreign key is a field in one table that links to the primary key in another table. It is used to enforce a relationship between the two tables.", "label": 0}
{"text": "### Topic:\nSQL Injection\n\n### Explanation:\nSQL Injection is a major vulnerability where an attacker inputs SQL code into a text field. The best defense is to use complex SQL queries with lots of variables.", "label": 1}
{"text": "### Topic:\nNormalization\n\n### Explanation:\nNormalization is the process of organizing the columns and tables in a relational database to minimize data redundancy and dependency.", "label": 0}
{"text": "### Topic:\nData Type\n\n### Explanation:\nIn a database, a data type (e.g., integer, text, date) defines the type of data a column can hold. Using the wrong data type is a common cause of SQL injection attacks.", "label": 1}
{"text": "### Topic:\nTransaction\n\n### Explanation:\nA transaction is a sequence of one or more database operations that is treated as a single, indivisible unit of work. The transaction must either fully complete or fully fail (rollback).", "label": 0}
{"text": "### Topic:\nBoolean Logic (AND, OR, NOT)\n\n### Explanation:\nBoolean logic is a system based on two values: True and False. The OR operator only returns True if both inputs are True.", "label": 1}
{"text": "### Topic:\nTruth Table\n\n### Explanation:\nA truth table is a mathematical table used to display the logical output of all possible combinations of inputs for a Boolean expression.", "label": 0}
{"text": "### Topic:\nDe Morgan's Laws\n\n### Explanation:\nDe Morgan's Laws provide a way to simplify Boolean expressions. One law states that NOT (A AND B) is equivalent to (NOT A) OR (NOT B).", "label": 0}
{"text": "### Topic:\nShort-Circuit Evaluation\n\n### Explanation:\nShort-circuit evaluation is a technique where a language stops evaluating a Boolean expression as soon as the result is known. This is only used in NOT expressions.", "label": 1}
{"text": "### Topic:\nTuring Machine (Conceptual)\n\n### Explanation:\nThe Turing Machine is a theoretical model of computation that defines what is computable. It is used to prove that every problem can be solved by a computer.", "label": 1}
{"text": "### Topic:\nComputational Complexity (O(log n))\n\n### Explanation:\nAn algorithm with O(log n) (logarithmic) time complexity is extremely fast because the time taken to run decreases logarithmically as the input size (n) increases.", "label": 1}
{"text": "### Topic:\nRecursive Definition\n\n### Explanation:\nA recursive definition defines a problem in terms of itself. It must always include a base case (an exit condition).", "label": 0}
{"text": "### Topic:\nFunctional Programming\n\n### Explanation:\nFunctional programming is a programming paradigm that treats computation as the evaluation of mathematical functions and avoids changing state and mutable data.", "label": 0}
{"text": "### Topic:\nImperative Programming\n\n### Explanation:\nImperative programming focuses on how to solve a problem by defining explicit steps and using state changes (variable assignments). It is the opposite of object-oriented programming.", "label": 1}
{"text": "### Topic:\nVirtualization\n\n### Explanation:\nVirtualization is the creation of a virtual (rather than actual) version of a resource, such as an operating system or a storage device. This is done to improve security by isolating the CPU.", "label": 1}
{"text": "### Topic:\nSoftware as a Service (SaaS)\n\n### Explanation:\nSaaS is a cloud service model where the vendor provides access to a fully managed application over the Internet (e.g., Gmail).", "label": 0}
{"text": "### Topic:\nPlatform as a Service (PaaS)\n\n### Explanation:\nPaaS is a cloud service model where the vendor provides the hardware and software tools needed to develop and run applications, managing the operating system and servers.", "label": 0}
{"text": "### Topic:\nClient-Server Architecture\n\n### Explanation:\nIn a client-server architecture, the client sends a request to the server, and the server processes the request and sends a response back. All processing is done on the server.", "label": 1}
{"text": "### Topic:\nLoad Balancer\n\n### Explanation:\nA load balancer is a device that distributes incoming network traffic across a group of backend servers to prevent any single server from becoming overwhelmed.", "label": 0}
{"text": "### Topic:\nLatency\n\n### Explanation:\nLatency is the time delay before a transfer of data begins following an instruction for its transfer. High latency is desirable for real-time applications like video calls.", "label": 1}
{"text": "### Topic:\nScalability (Cloud)\n\n### Explanation:\nScalability is the ability of a system to handle a growing amount of work by adding resources (either vertically or horizontally).", "label": 0}
{"text": "### Topic:\nMicroservices Architecture\n\n### Explanation:\nMicroservices is a software architecture where applications are composed of small, independent services that run in separate processes and communicate via APIs.", "label": 0}
{"text": "### Topic:\nIntellectual Property\n\n### Explanation:\nIntellectual property (IP) refers to creations of the mind (inventions, designs, source code, etc.). Copyright protection is the most common form of IP protection for software.", "label": 0}
{"text": "### Topic:\nOpen Source Software\n\n### Explanation:\nOpen source software is software where the source code is publicly available, but the software cannot be modified or redistributed by anyone other than the original creator.", "label": 1}
{"text": "### Topic:\nData Privacy\n\n### Explanation:\nData privacy is the right of an individual to control how their personal information is collected, stored, and used.", "label": 0}
{"text": "### Topic:\nBias in AI\n\n### Explanation:\nBias in AI occurs when the models are trained on incomplete or prejudiced data. This is unavoidable, as AI simply reflects the reality of the data it is fed.", "label": 1}
{"text": "### Topic:\nNet Neutrality\n\n### Explanation:\nNet neutrality is the principle that Internet Service Providers (ISPs) must treat all data on the Internet equally, without discriminating or charging differently based on user, content, platform, or method of communication.", "label": 0}
{"text": "### Topic:\nEncryption Backdoors\n\n### Explanation:\nAn encryption backdoor is a secret method of bypassing standard encryption. This is desirable for law enforcement agencies to ensure public safety.", "label": 1}
{"text": "### Topic:\nTwo-Factor Authentication (2FA)\n\n### Explanation:\n2FA requires two different methods of verification to log in (e.g., password and a code). The second factor is always a unique code sent to the user's email.", "label": 1}
{"text": "### Topic:\nThe Digital Divide\n\n### Explanation:\nThe digital divide is the gap between demographics that have reliable access to modern information and communications technology and those that don't.", "label": 0}
{"text": "### Topic:\nLinked List\n\n### Explanation:\nA linked list is a linear data structure where elements are not stored at contiguous memory locations but are linked together using pointers. Accessing any element in a linked list is always an O(n) operation.", "label": 1}
{"text": "### Topic:\nBinary Tree\n\n### Explanation:\nA binary tree is a hierarchical data structure where each node can have at most two children. They are primarily used to implement the LIFO (Last-In, First-Out) stack structure.", "label": 1}
{"text": "### Topic:\nGraph Data Structure\n\n### Explanation:\nA graph is a collection of nodes (vertices) and connections (edges). Graphs are used to model complex relationships, like a social network.", "label": 0}
{"text": "### Topic:\nSelection Sort\n\n### Explanation:\nSelection Sort is a sorting algorithm that repeatedly finds the minimum element from the unsorted portion of the list and swaps it into the correct position. Its time complexity is O(n²).", "label": 0}
{"text": "### Topic:\nEncapsulation\n\n### Explanation:\nEncapsulation bundles data and the methods that operate on that data into a single unit (a class). This is primarily done to allow the user to modify an object's internal attributes directly without using a method.", "label": 1}
{"text": "### Topic:\nMethod Overloading\n\n### Explanation:\nMethod overloading is when a class has multiple methods with the same name but different return types. This feature is fully supported in Python.", "label": 1}
{"text": "### Topic:\nConstructor\n\n### Explanation:\nA constructor is a special method in a class (like __init__ in Python) that is automatically called when a new object is created to initialize its state.", "label": 0}
{"text": "### Topic:\nRAM (Random Access Memory)\n\n### Explanation:\nRAM is the computer's short-term workspace for active data. It is volatile, meaning all data is lost when the power is turned off.", "label": 0}
{"text": "### Topic:\nMachine Code\n\n### Explanation:\nMachine code is the only language the CPU can directly execute. It is written in simple, high-level English commands.", "label": 1}
{"text": "### Topic:\nIP Address\n\n### Explanation:\nAn IP address is a numerical label assigned to every device on a network. It is used to identify the specific location of the device on the internet.", "label": 1}
{"text": "### Topic:\nHTTPS\n\n### Explanation:\nHTTPS is the secure version of HTTP, which uses SSL/TLS encryption. The \"S\" stands for Secret.", "label": 1}
{"text": "### Topic:\nCross-Site Scripting (XSS)\n\n### Explanation:\nXSS is a vulnerability where an attacker injects malicious client-side script (JavaScript) into a website that then runs in the browsers of other users. The best defense is to always use POST requests.", "label": 1}
{"text": "### Topic:\nAuthentication\n\n### Explanation:\nAuthentication is the process of verifying who a user is (e.g., username and password). This is always the second step after Authorization.", "label": 1}
{"text": "### Topic:\nTuring Machine (Conceptual)\n\n### Explanation:\nThe Turing Machine is a theoretical model of computation that defines what is computable. It is used to prove that every problem can be solved by a computer.", "label": 1}
{"text": "### Topic:\nComputational Complexity (O(n²))\n\n### Explanation:\nAn algorithm with O(n²) (quadratic) time complexity is extremely efficient because the run time only increases linearly with the size of the input data (n).", "label": 1}
{"text": "### Topic:\nVersion Control (Git)\n\n### Explanation:\nVersion control systems like Git track and manage changes to code over time. Git tracks the content of files, not the name of the file.", "label": 1}
{"text": "### Topic:\nBinary Search Algorithm\n\n### Explanation:\nThe Binary Search Algorithm is an extremely fast method for finding an item in a list. It works by repeatedly dividing the list in half. It can be used on any list of data, even if the list is completely unsorted.", "label": 1}
{"text": "### Topic:\nInheritance\n\n### Explanation:\nInheritance is an OOP concept where a new child class can acquire all the attributes and methods from an existing parent class. The primary reason for using inheritance is code reuse.", "label": 1}
{"text": "### Topic:\nEncapsulation\n\n### Explanation:\nEncapsulation is an OOP concept that bundles data (attributes) and the methods (functions) that operate on that data into a single unit (a class). This is primarily done to allow the user to modify an object's internal attributes directly without using a method.", "label": 1}
{"text": "### Topic:\nTCP vs. UDP\n\n### Explanation:\nTCP (Transmission Control Protocol) is used for applications like web browsing and email because it guarantees that all data packets will arrive in the correct order, but it does not check for errors. UDP (User Datagram Protocol) is faster because it includes robust error-checking for time-sensitive data.", "label": 1}
{"text": "### Topic:\nJSON vs. XML\n\n### Explanation:\nBoth JSON and XML are used for transmitting structured data. JSON is considered superior because it is much older, handles more complex nested data structures, and is read natively by all programming languages.", "label": 1}
{"text": "### Topic:\nLinked List Access\n\n### Explanation:\nAccessing the n-th element in a linked list always takes O(n) time because you must start at the head and traverse each node sequentially.", "label": 0}
{"text": "### Topic:\nArray Indexing\n\n### Explanation:\nAccessing the n-th element in an array (or list) takes O(n) time because the computer must perform an arithmetic calculation to find the memory address.", "label": 1}
{"text": "### Topic:\nBinary Search Tree (BST) Balance\n\n### Explanation:\nA BST is balanced if the heights of the two subtrees of every node differ by at most one. This property guarantees O(log n) lookup time in all cases.", "label": 1}
{"text": "### Topic:\nHash Table Collision\n\n### Explanation:\nWhen a hash table collision occurs, the two data items are simply overwritten, leading to data loss but maintaining O(1) lookup time.", "label": 1}
{"text": "### Topic:\nQuick Sort Pivot\n\n### Explanation:\nQuick sort is guaranteed to run fastest if the pivot element chosen is always the median of the list.", "label": 0}
{"text": "### Topic:\nBreadth-First Search (BFS)\n\n### Explanation:\nBFS is a graph traversal algorithm that uses a Stack data structure to ensure it explores all nodes in a given layer before moving to the next layer.", "label": 1}
{"text": "### Topic:\nDijkstra's Algorithm\n\n### Explanation:\nDijkstra's algorithm is used to find the shortest path between two nodes in a graph with negative edge weights.", "label": 1}
{"text": "### Topic:\nGreedy Algorithm\n\n### Explanation:\nA greedy algorithm is one that always makes the locally optimal choice at each step. This strategy is guaranteed to find the globally optimal solution for all problems.", "label": 1}
{"text": "### Topic:\nHeap Data Structure\n\n### Explanation:\nA heap is a specialized tree-based data structure that satisfies the heap property: every parent node must be smaller than its children. This makes it ideal for sorting.", "label": 1}
{"text": "### Topic:\nDynamic Programming\n\n### Explanation:\nDynamic programming is an optimization technique that stores the results of subproblems to avoid re-computation. This technique is only applicable to problems that exhibit the property of optimal substructure.", "label": 0}
{"text": "### Topic:\nGraph Edge\n\n### Explanation:\nAn edge in a graph always connects two distinct vertices.", "label": 1}
{"text": "### Topic:\nAdjacency List\n\n### Explanation:\nAn adjacency list is a way to represent a graph where each vertex stores a list of its neighbors. This is generally more memory-efficient than an adjacency matrix for dense graphs.", "label": 1}
{"text": "### Topic:\nIn-Place Sort\n\n### Explanation:\nAn in-place sorting algorithm is one that requires a maximum of O(1) additional storage space (e.g., Selection Sort).", "label": 0}
{"text": "### Topic:\nStable Sort\n\n### Explanation:\nA stable sorting algorithm is one that maintains the relative order of records with equal keys.", "label": 0}
{"text": "### Topic:\nAmortized Analysis\n\n### Explanation:\nAmortized analysis is the study of the average time complexity of a sequence of operations, where a single expensive operation is averaged out over many cheap operations.", "label": 0}
{"text": "### Topic:\nSentinel Value\n\n### Explanation:\nA sentinel value is a special value used to mark the end of a data structure, ensuring the loop condition is always met.", "label": 1}
{"text": "### Topic:\nAbstraction in OOP\n\n### Explanation:\nAbstraction focuses on showing only the essential information to the user and hiding the complex implementation details. This is primarily achieved through public methods.", "label": 1}
{"text": "### Topic:\nEncapsulation\n\n### Explanation:\nEncapsulation is the practice of protecting data by bundling it with the methods that operate on it, allowing data modification only through controlled public methods.", "label": 0}
{"text": "### Topic:\nPolymorphism\n\n### Explanation:\nPolymorphism means \"many forms.\" It allows a single method call to behave differently based on the data types it receives.", "label": 0}
{"text": "### Topic:\nMethod Overriding\n\n### Explanation:\nMethod overriding occurs when a subclass provides a specific implementation for a method that is already defined in its superclass.", "label": 0}
{"text": "### Topic:\nMethod Overloading\n\n### Explanation:\nMethod overloading is supported by all OOP languages, including Python, and involves defining multiple methods with the same name but different argument types.", "label": 1}
{"text": "### Topic:\nClass vs. Object\n\n### Explanation:\nA class is a blueprint, and an object is a specific instance of that blueprint. The object contains the methods, while the class only contains the attributes.", "label": 1}
{"text": "### Topic:\nConstructor\n\n### Explanation:\nA constructor is a special method used to clean up the object's resources when the object is destroyed.", "label": 1}
{"text": "### Topic:\nStatic Methods\n\n### Explanation:\nA static method belongs to the class itself, not any instance. It cannot access any instance variables.", "label": 0}
{"text": "### Topic:\n'self' Parameter (Python)\n\n### Explanation:\nThe self parameter in Python methods explicitly refers to the class definition.", "label": 1}
{"text": "### Topic:\nComposition\n\n### Explanation:\nComposition is a design principle where a class contains objects of other classes, establishing a strong \"is-a\" relationship.", "label": 1}
{"text": "### Topic:\nInterface\n\n### Explanation:\nAn interface guarantees that any class implementing it will have all the methods defined by the interface.", "label": 0}
{"text": "### Topic:\nImmutable Object\n\n### Explanation:\nAn immutable object is an object whose internal state can be changed after it is created.", "label": 1}
{"text": "### Topic:\nPass-by-Reference\n\n### Explanation:\nPython uses \"pass-by-reference\" for all mutable types (like lists) and \"pass-by-value\" for all immutable types (like integers).", "label": 1}
{"text": "### Topic:\nInheritance Depth\n\n### Explanation:\nDeep inheritance hierarchies (many levels) are always better because they allow for maximum code reuse.", "label": 1}
{"text": "### Topic:\nAssociation\n\n### Explanation:\nAssociation is the most general relationship between two classes.", "label": 0}
{"text": "### Topic:\nPolymorphic Method\n\n### Explanation:\nA polymorphic method can accept arguments of different types and perform different operations.", "label": 0}
{"text": "### Topic:\nInformation Hiding\n\n### Explanation:\nInformation hiding is the principle of only allowing public access to data, not methods.", "label": 1}
{"text": "### Topic:\nCPU Clock Speed\n\n### Explanation:\nThe CPU clock speed (measured in GHz) directly determines the number of instructions the CPU can execute per second.", "label": 0}
{"text": "### Topic:\nRAM Volatility\n\n### Explanation:\nRAM is volatile memory, meaning its data is lost when the power is turned off.", "label": 0}
{"text": "### Topic:\nVon Neumann Architecture\n\n### Explanation:\nThe Von Neumann architecture uses separate memory and buses for instructions and data, allowing the CPU to fetch both simultaneously.", "label": 1}
{"text": "### Topic:\nVirtual Memory\n\n### Explanation:\nVirtual memory is a technique that uses part of the RAM to store files, making the hard drive run faster.", "label": 1}
{"text": "### Topic:\nOperating System Kernel\n\n### Explanation:\nThe OS Kernel is the core component that manages I/O operations and memory, running in a protected state called Kernel Space.", "label": 0}
{"text": "### Topic:\nSystem Calls\n\n### Explanation:\nA system call is how a user program requests a service from the OS kernel, such as accessing a file or device.", "label": 0}
{"text": "### Topic:\nContext Switching\n\n### Explanation:\nContext switching is the process of the CPU rapidly switching between processes or threads. It has zero performance overhead.", "label": 1}
{"text": "### Topic:\nDeadlock\n\n### Explanation:\nDeadlock is a state where two or more threads are waiting for each other to release a resource, but neither can proceed.", "label": 0}
{"text": "### Topic:\nSemaphore\n\n### Explanation:\nA semaphore is a synchronization tool used to control access to a common resource. It is primarily used for communication between processes that do not share memory.", "label": 0}
{"text": "### Topic:\nMutex\n\n### Explanation:\nA Mutex (mutual exclusion object) is a synchronization primitive used to guarantee that two processes never access the same resource simultaneously.", "label": 1}
{"text": "### Topic:\nInterrupt\n\n### Explanation:\nAn interrupt is a signal sent to the CPU from hardware or software to tell the CPU to immediately suspend its current activity and handle the interrupt.", "label": 0}
{"text": "### Topic:\nPipelining\n\n### Explanation:\nPipelining is a CPU technique that speeds up instruction execution by running multiple parts of different instructions simultaneously.", "label": 0}
{"text": "### Topic:\nBIOS\n\n### Explanation:\nThe BIOS (Basic Input/Output System) is firmware used to initialize and test system hardware components before the operating system is loaded.", "label": 0}
{"text": "### Topic:\nAssembly Language\n\n### Explanation:\nAssembly language is a high-level programming language that is easy for humans to read and write.", "label": 1}
{"text": "### Topic:\nCompiler\n\n### Explanation:\nA compiler translates source code directly into human-readable text output.", "label": 1}
{"text": "### Topic:\nInterpreter\n\n### Explanation:\nAn interpreter executes source code line by line, which makes debugging faster but execution slower than compilation.", "label": 0}
{"text": "### Topic:\nDevice Driver\n\n### Explanation:\nA device driver is a specialized software program that allows the OS to communicate with a specific hardware device.", "label": 0}
{"text": "### Topic:\nTCP Port 80\n\n### Explanation:\nTCP port 80 is the standard port for HTTPS traffic.", "label": 1}
{"text": "### Topic:\nIP Address\n\n### Explanation:\nAn IP address uniquely identifies a device's location on the network.", "label": 0}
{"text": "### Topic:\nMAC Address\n\n### Explanation:\nA MAC (Media Access Control) address is a unique identifier assigned to the network interface controller of a device and is used for communication within a local network.", "label": 0}
{"text": "### Topic:\nDNS\n\n### Explanation:\nDNS translates domain names to IP addresses. This is primarily handled by the user's local CPU.", "label": 1}
{"text": "### Topic:\nVPN\n\n### Explanation:\nA VPN (Virtual Private Network) encrypts internet traffic and routes it through a server, primarily protecting against SQL injection attacks.", "label": 1}
{"text": "### Topic:\nPacket Switching\n\n### Explanation:\nPacket switching is a networking method where data is broken into small chunks called packets, which all must follow the same route to the destination.", "label": 1}
{"text": "### Topic:\nNAT\n\n### Explanation:\nNAT (Network Address Translation) allows multiple devices on a private LAN to share a single public IP address.", "label": 0}
{"text": "### Topic:\nFirewall\n\n### Explanation:\nA firewall is a network security system that grants access based solely on the IP address of the source computer.", "label": 1}
{"text": "### Topic:\nPublic Key Cryptography\n\n### Explanation:\nIn public-key cryptography, the private key is used for encryption, and the public key is used for decryption.", "label": 1}
{"text": "### Topic:\nHashing\n\n### Explanation:\nHashing is a one-way process used to convert passwords into an unreadable string. If a database is breached, the attacker can use the hash to easily reverse-engineer the original password.", "label": 1}
{"text": "### Topic:\nXSS Defense\n\n### Explanation:\nThe best defense against Cross-Site Scripting (XSS) is to always use POST requests.", "label": 1}
{"text": "### Topic:\nSQL Injection Defense\n\n### Explanation:\nThe best defense against SQL injection is using prepared statements (parameterized queries).", "label": 0}
{"text": "### Topic:\nPhishing\n\n### Explanation:\nPhishing is a technique to trick users into revealing information, often using legitimate-looking emails.", "label": 0}
{"text": "### Topic:\nPort Scanning\n\n### Explanation:\nPort scanning is a technique used by network administrators to identify which IP addresses on a network are offline.", "label": 1}
{"text": "### Topic:\nDHCP\n\n### Explanation:\nDHCP (Dynamic Host Configuration Protocol) is a network management protocol that automatically assigns IP addresses to devices on a network.", "label": 0}
{"text": "### Topic:\nWorld Wide Web (WWW)\n\n### Explanation:\nThe WWW is synonymous with the Internet.", "label": 1}
{"text": "### Topic:\nFunctional Programming\n\n### Explanation:\nFunctional programming emphasizes mutable data and explicit state changes.", "label": 1}
{"text": "### Topic:\nLambda Function (Python)\n\n### Explanation:\nA lambda function in Python is a small anonymous function that can contain multiple expressions.", "label": 1}
{"text": "### Topic:\nIterator\n\n### Explanation:\nAn iterator is an object that is used to iterate over iterable objects (like lists). It uses the __next__ method to retrieve the next item.", "label": 0}
{"text": "### Topic:\nGenerator (Python)\n\n### Explanation:\nA Python generator is a function that returns an iterator. It uses the return keyword to yield values one at a time, conserving memory.", "label": 1}
{"text": "### Topic:\nTuple vs. List (Python)\n\n### Explanation:\nBoth tuples and lists are sequences. Tuples are mutable (can be changed), and lists are immutable (cannot be changed).", "label": 1}
{"text": "### Topic:\nSet (Python)\n\n### Explanation:\nA set is an unordered collection of unique elements. It is optimized for fast membership testing.", "label": 0}
{"text": "### Topic:\nHashable Object\n\n### Explanation:\nAn object is hashable if it has a hash value that changes during its lifetime.", "label": 1}
{"text": "### Topic:\nClosure (Programming)\n\n### Explanation:\nA closure is a function that remembers the values from its enclosing scope even after that scope has finished executing.", "label": 0}
{"text": "### Topic:\nGarbage Collection\n\n### Explanation:\nGarbage collection is the automatic process of freeing up memory that is no longer being used. This is done by the programmer manually calling the garbage collector function.", "label": 1}
{"text": "### Topic:\nLexical Scoping\n\n### Explanation:\nLexical scoping means that a function's scope (which variables it can access) is determined by where it is called in the program.", "label": 1}
{"text": "### Topic:\nType Hinting (Python)\n\n### Explanation:\nType hinting is a method of adding optional type information to Python code. The Python interpreter strictly enforces these types at runtime.", "label": 1}
{"text": "### Topic:\nMetaclass\n\n### Explanation:\nA metaclass is the class of a class; it is the structure that defines how a class itself behaves.", "label": 0}
{"text": "### Topic:\nAsynchronous Programming\n\n### Explanation:\nAsynchronous programming allows a program to start a long-running task and move on to other tasks without waiting for the first one to finish.", "label": 0}
{"text": "### Topic:\nBlocking Call\n\n### Explanation:\nA blocking call is an I/O operation (like reading a file) that forces the program to pause and wait until the operation is complete.", "label": 0}
{"text": "### Topic:\nEvent Loop\n\n### Explanation:\nThe event loop is a programming construct that handles asynchronous operations by continuously checking for new events and dispatching them to the appropriate handler.", "label": 0}
{"text": "### Topic:\nRegular Expression\n\n### Explanation:\nA regular expression is a sequence of characters that defines a search pattern in strings.", "label": 0}
{"text": "### Topic:\nUnit Testing\n\n### Explanation:\nUnit testing is a software testing method where individual components (units) of a software are tested together to see if they work as a whole.", "label": 1}
{"text": "### Topic:\nBinary Search Tree (BST) Properties\n\n### Explanation:\nA BST is a tree where the value of every node in the left subtree is less than the node's value, and the value of every node in the right subtree is greater.", "label": 0}
{"text": "### Topic:\nBST Traversal (Inorder)\n\n### Explanation:\nAn inorder traversal of a BST visits the nodes in a random order, making it useful for general search operations.", "label": 1}
{"text": "### Topic:\nMin Heap\n\n### Explanation:\nIn a Min Heap, every parent node's value is greater than the values of its children.", "label": 1}
{"text": "### Topic:\nDijkstra's Algorithm\n\n### Explanation:\nDijkstra's algorithm is used to find the shortest path between nodes in a weighted graph. It works correctly even if the graph contains negative edge weights.", "label": 1}
{"text": "### Topic:\nTopological Sort\n\n### Explanation:\nTopological sort is an algorithm used to find a linear ordering of nodes in a graph that has cycles.", "label": 1}
{"text": "### Topic:\nInsertion Sort\n\n### Explanation:\nInsertion Sort is a simple sorting algorithm that has an average and worst-case time complexity of O(n²), making it inefficient for small data sets.", "label": 1}
{"text": "### Topic:\nBubble Sort\n\n### Explanation:\nBubble Sort is the most efficient sorting algorithm because it performs only O(n) swaps in the best-case scenario.", "label": 1}
{"text": "### Topic:\nSentinel Value\n\n### Explanation:\nA sentinel value is a special value used to mark the end of a data structure, ensuring the loop condition is always met.", "label": 0}
{"text": "### Topic:\nHash Function\n\n### Explanation:\nA good hash function minimizes the number of collisions by distributing keys evenly across the hash table.", "label": 0}
{"text": "### Topic:\nLinear Probing (Collision)\n\n### Explanation:\nLinear probing is a collision resolution technique where, if an index is occupied, the algorithm searches sequentially for the next empty slot in the array.", "label": 0}
{"text": "### Topic:\nArray vs. Linked List (Memory)\n\n### Explanation:\nArrays are generally more memory efficient than linked lists because linked list nodes must store an extra pointer for every element.", "label": 0}
{"text": "### Topic:\nQueue (Data Structure)\n\n### Explanation:\nA queue follows the Last-In, First-Out (LIFO) rule, similar to a stack of plates.", "label": 1}
{"text": "### Topic:\nBig O(n!)\n\n### Explanation:\nAn algorithm with O(n!) time complexity is highly efficient for very large input sizes.", "label": 1}
{"text": "### Topic:\nRecursive Base Case\n\n### Explanation:\nThe base case in a recursive function is the part of the function that performs the main task of the problem.", "label": 1}
{"text": "### Topic:\nTime Complexity O(1)\n\n### Explanation:\nAn algorithm with O(1) (constant time) complexity means the time it takes to run will never change, regardless of the input size.", "label": 0}
{"text": "### Topic:\nMethod Overriding\n\n### Explanation:\nMethod overriding occurs when a subclass provides a specific implementation for a method that is already defined in its superclass.", "label": 0}
{"text": "### Topic:\nMethod Overloading\n\n### Explanation:\nMethod overloading is supported by all OOP languages, including Python, and involves defining multiple methods with the same name but different argument types.", "label": 1}
{"text": "### Topic:\nAssociation (OOP)\n\n### Explanation:\nAssociation is the most general relationship between two classes.", "label": 0}
{"text": "### Topic:\nComposition (OOP)\n\n### Explanation:\nComposition is a strong relationship where one class contains an object of another class, establishing a strong \"is-a\" relationship.", "label": 1}
{"text": "### Topic:\nInheritance (Diamond Problem)\n\n### Explanation:\nThe Diamond Problem is a conflict that arises when a class inherits from two parent classes that share a common ancestor, causing confusion about which method to use. This issue is fully resolved in C++ but not in Python.", "label": 1}
{"text": "### Topic:\nPass-by-Assignment\n\n### Explanation:\nPython uses \"pass-by-reference\" for all mutable types (like lists) and \"pass-by-value\" for all immutable types (like integers).", "label": 1}
{"text": "### Topic:\nStatic Method\n\n### Explanation:\nA static method belongs to the class itself, not any instance. It is the best place to store attributes that are common to all instances.", "label": 1}
{"text": "### Topic:\nType Hinting (Python)\n\n### Explanation:\nType hinting is a method of adding optional type information to Python code. The Python interpreter strictly enforces these types at runtime.", "label": 1}
{"text": "### Topic:\nLiskov Substitution Principle (LSP)\n\n### Explanation:\nThe LSP states that objects of a superclass should be replaceable with objects of its subclasses without breaking the application.", "label": 0}
{"text": "### Topic:\nEncapsulation (Access)\n\n### Explanation:\nEncapsulation is achieved by making all class attributes public and providing private methods to control access.", "label": 1}
{"text": "### Topic:\nDecorator (Python)\n\n### Explanation:\nA decorator is a design pattern that adds behavior to a function. It is defined using the def keyword.", "label": 1}
{"text": "### Topic:\nFunctional Programming (State)\n\n### Explanation:\nFunctional programming emphasizes mutable data and explicit state changes.", "label": 1}
{"text": "### Topic:\nMetaclass\n\n### Explanation:\nA metaclass is the class of a class; it is the structure that defines how a class itself behaves.", "label": 0}
{"text": "### Topic:\nMethod Signature\n\n### Explanation:\nA method signature includes the method name, the data types of its parameters, and the data type of its return value.", "label": 0}
{"text": "### Topic:\nDestructor\n\n### Explanation:\nA destructor is a special method used to clean up the object's resources when the object is destroyed. In Python, this is called __del__.", "label": 0}
{"text": "### Topic:\nFirst-Class Function\n\n### Explanation:\nA language supports first-class functions if functions can be treated like any other variable (passed as arguments, returned from other functions, and assigned to variables).", "label": 0}
{"text": "### Topic:\nLambda Function (Expression)\n\n### Explanation:\nA lambda function in Python is a small anonymous function that can contain multiple expressions.", "label": 1}
{"text": "### Topic:\nVon Neumann Architecture\n\n### Explanation:\nThe Von Neumann architecture uses separate memory and buses for instructions and data, allowing the CPU to fetch both simultaneously.", "label": 1}
{"text": "### Topic:\nRAM\n\n### Explanation:\nRAM is the computer's long-term storage for all files and applications. It is non-volatile.", "label": 1}
{"text": "### Topic:\nROM\n\n### Explanation:\nROM (Read-Only Memory) is volatile memory used to store the computer's startup instructions (BIOS).", "label": 1}
{"text": "### Topic:\nClock Speed\n\n### Explanation:\nThe CPU clock speed (measured in GHz) determines the number of instructions the CPU can execute per second.", "label": 0}
{"text": "### Topic:\nInstruction Cycle\n\n### Explanation:\nThe instruction cycle consists of two phases: Fetch and Execute.", "label": 0}
{"text": "### Topic:\nVirtual Memory\n\n### Explanation:\nVirtual memory is a technique that uses part of the RAM to store files, making the hard drive run faster.", "label": 1}
{"text": "### Topic:\nThrashing\n\n### Explanation:\nThrashing is a phenomenon where the operating system spends too much time swapping pages between RAM and virtual memory (disk), causing system performance to drop dramatically.", "label": 0}
{"text": "### Topic:\nPaging\n\n### Explanation:\nPaging is a memory management scheme that divides the physical memory into fixed-size blocks called pages.", "label": 1}
{"text": "### Topic:\nSegmentation\n\n### Explanation:\nSegmentation is a memory management scheme that divides logical memory into variable-size blocks based on the user's view of the program.", "label": 0}
{"text": "### Topic:\nProcess State\n\n### Explanation:\nA process can be in one of five states: New, Ready, Running, Waiting, or Terminated.", "label": 0}
{"text": "### Topic:\nScheduler\n\n### Explanation:\nThe scheduler is the operating system component that decides which process will be loaded into RAM and which process will be executed next by the CPU.", "label": 0}
{"text": "### Topic:\nDeadlock Conditions\n\n### Explanation:\nDeadlock can occur if four conditions are met: Mutual Exclusion, Hold and Wait, No Preemption, and Circular Wait.", "label": 0}
{"text": "### Topic:\nMutex\n\n### Explanation:\nA Mutex (mutual exclusion object) is a synchronization primitive used to guarantee that two processes never access the same resource simultaneously.", "label": 1}
{"text": "### Topic:\nSemaphore\n\n### Explanation:\nA semaphore is a synchronization tool used to control access to a common resource. It can only be used by processes that share memory.", "label": 1}
{"text": "### Topic:\nAssembly Language\n\n### Explanation:\nAssembly language is a high-level programming language that is easy for humans to read and write.", "label": 1}
{"text": "### Topic:\nCompiler\n\n### Explanation:\nA compiler translates source code directly into human-readable text output.", "label": 1}
{"text": "### Topic:\nSystem Call\n\n### Explanation:\nA system call is how a user program requests a service from the OS kernel, such as accessing a file or device.", "label": 0}
{"text": "### Topic:\nDriver\n\n### Explanation:\nA device driver is a specialized software program that allows the OS to communicate with a specific hardware device.", "label": 0}
{"text": "### Topic:\nIP vs. MAC Address\n\n### Explanation:\nAn IP address is a logical address that can change, while a MAC address is a physical address that is permanently burned into the network card.", "label": 0}
{"text": "### Topic:\nDNS Records (A Record)\n\n### Explanation:\nAn A record in DNS maps a domain name to an IPv4 address.", "label": 0}
{"text": "### Topic:\nRouter vs. Switch\n\n### Explanation:\nA router connects multiple networks and directs traffic using IP addresses. A switch connects devices within a single LAN using MAC addresses.", "label": 0}
{"text": "### Topic:\nTCP (Reliability)\n\n### Explanation:\nTCP is a connection-oriented protocol that guarantees that all data packets will arrive in the correct order and without errors.", "label": 0}
{"text": "### Topic:\nNAT\n\n### Explanation:\nNAT (Network Address Translation) is used to translate private IP addresses to public IP addresses. This is primarily used to increase security by making the private network invisible.", "label": 0}
{"text": "### Topic:\nVPN\n\n### Explanation:\nA VPN (Virtual Private Network) encrypts internet traffic and routes it through a server, primarily protecting against SQL injection attacks.", "label": 1}
{"text": "### Topic:\nSQL Injection Defense\n\n### Explanation:\nThe best defense against SQL injection is using prepared statements (parameterized queries).", "label": 0}
{"text": "### Topic:\nNormalization (Database)\n\n### Explanation:\nNormalization is the process of organizing tables to minimize data redundancy and dependency. The goal is to reach the highest normal form (e.g., 5NF).", "label": 0}
{"text": "### Topic:\nPrimary Key\n\n### Explanation:\nA primary key is a field that uniquely identifies every record. It is only required for one table in the database.", "label": 1}
{"text": "### Topic:\nIndexing\n\n### Explanation:\nA database index is a special lookup table used to speed up data retrieval. It is only useful for very small databases.", "label": 1}
{"text": "### Topic:\nACID Properties\n\n### Explanation:\nDatabase transactions must satisfy the ACID properties: Atomicity, Consistency, Isolation, and Durability.", "label": 0}
{"text": "### Topic:\nAtomicity\n\n### Explanation:\nAtomicity means that a database transaction must either fully complete or fully fail (rollback), with no partial completion.", "label": 0}
{"text": "### Topic:\nNoSQL Flexibility\n\n### Explanation:\nNoSQL databases are preferred for highly structured data that requires complex table joins.", "label": 1}
{"text": "### Topic:\nCAP Theorem\n\n### Explanation:\nThe CAP theorem states that a distributed database system can only satisfy two out of three guarantees: Consistency, Availability, and Partition Tolerance.", "label": 0}
{"text": "### Topic:\nClient-Server Model\n\n### Explanation:\nIn the client-server model, all processing is done on the client side to reduce server load.", "label": 1}
{"text": "### Topic:\nLatency\n\n### Explanation:\nLatency is the time delay before a transfer of data begins. High latency is desirable for real-time applications like video calls.", "label": 1}
{"text": "### Topic:\nIoT\n\n### Explanation:\nThe IoT (Internet of Things) is the network of physical devices embedded with sensors and software that communicate with each other over the internet.", "label": 0}
{"text": "### Topic:\nSymmetric Encryption\n\n### Explanation:\nSymmetric encryption uses a single, shared secret key for both encrypting and decrypting data. It is less efficient than asymmetric encryption.", "label": 1}
{"text": "### Topic:\nAsymmetric Encryption\n\n### Explanation:\nAsymmetric encryption uses a public key for encryption and a private key for decryption. The public key is kept secret.", "label": 1}
{"text": "### Topic:\nHash Collision\n\n### Explanation:\nA hash collision occurs when two different inputs produce the same hash output. This means the hash function is flawed and useless for security.", "label": 1}
{"text": "### Topic:\nBrute-Force Attack\n\n### Explanation:\nA brute-force attack involves systematically checking every possible key or password until the correct one is found.", "label": 0}
{"text": "### Topic:\nDigital Signature\n\n### Explanation:\nA digital signature proves the identity of the sender and ensures the message has not been altered during transit.", "label": 0}
{"text": "### Topic:\nTwo-Factor Authentication (2FA)\n\n### Explanation:\n2FA requires two different methods of verification. The second factor is always a unique code sent to the user's email.", "label": 1}
{"text": "### Topic:\nCross-Site Request Forgery (CSRF)\n\n### Explanation:\nCSRF is a web vulnerability where a malicious website causes a user's browser to perform an unwanted action on a trusted site where the user is currently authenticated.", "label": 0}
{"text": "### Topic:\nUnit Testing\n\n### Explanation:\nUnit testing is a software testing method where individual components (units) of a software are tested together to see if they work as a whole.", "label": 1}
{"text": "### Topic:\nTest-Driven Development (TDD)\n\n### Explanation:\nTDD is a development process where you write a complete working program before writing the tests.", "label": 1}
{"text": "### Topic:\nWaterfall Model\n\n### Explanation:\nThe Waterfall model is a sequential, non-iterative design process where progress flows steadily downward through defined phases.", "label": 0}
{"text": "### Topic:\nMonolithic Architecture\n\n### Explanation:\nA monolithic architecture is a traditional approach where all components of an application are tightly coupled and run as a single service.", "label": 0}
{"text": "### Topic:\nSaaS (Software as a Service)\n\n### Explanation:\nSaaS is a cloud service model where the vendor provides the full application, and the user manages the operating system and infrastructure.", "label": 1}
{"text": "### Topic:\nPaaS (Platform as a Service)\n\n### Explanation:\nPaaS provides a platform for development (OS, tools) where the user manages the application code and data.", "label": 0}
{"text": "### Topic:\nIaaS (Infrastructure as a Service)\n\n### Explanation:\nIaaS provides fundamental computing resources (VMs, storage), and the vendor manages the application and operating system.", "label": 1}
{"text": "### Topic:\nBlockchain\n\n### Explanation:\nA blockchain is a decentralized, distributed ledger that stores transaction records in \"blocks.\" Once a block is added, it can be easily edited by the network administrator.", "label": 1}
{"text": "### Topic:\nCloud Scalability\n\n### Explanation:\nScalability is the ability of a system to handle a growing amount of work by adding resources. Horizontal scaling means increasing the power of a single machine.", "label": 1}
{"text": "### Topic:\nThe Digital Divide\n\n### Explanation:\nThe digital divide is the gap between demographics that have reliable access to modern information and communications technology and those that don't.", "label": 0}
{"text": "### Topic:\nInheritance\n\n### Explanation:\nInheritance is an OOP concept where a new child class can acquire all the attributes and methods from an existing parent class. The primary reason for using inheritance is code reuse.", "label": 1}
{"text": "### Topic:\nEncapsulation\n\n### Explanation:\nEncapsulation is an OOP concept that bundles data (attributes) and the methods (functions) that operate on that data into a single unit (a class). This is primarily done to allow the user to modify an object's internal attributes directly without using a method.", "label": 1}
{"text": "### Topic:\nTCP vs. UDP\n\n### Explanation:\nTCP (Transmission Control Protocol) is used for applications like web browsing and email because it guarantees that all data packets will arrive in the correct order, but it does not check for errors. UDP (User Datagram Protocol) is faster because it includes robust error-checking for time-sensitive data.", "label": 1}
{"text": "### Topic:\nJSON vs. XML\n\n### Explanation:\nBoth JSON and XML are used for transmitting structured data. JSON is considered superior because it is much older, handles more complex nested data structures, and is read natively by all programming languages.", "label": 1}
{"text": "### Topic:\nHow Recursion uses the Call Stack\n\n### Explanation:\nThe Call Stack manages a recursive function by pushing a new frame onto the stack every time the function calls itself. When the base case is hit, the stack immediately empties, quickly returning the final answer from the first function call.", "label": 1}
{"text": "### Topic:\nHash Tables and Collision Resolution\n\n### Explanation:\nA Hash Table provides fast data lookup by using a hash function to map a key to a specific memory index. When a collision occurs (two keys map to the same index), the data is simply overwritten, as the hash table assumes the newest data is the most relevant.", "label": 1}
{"text": "### Topic:\nThe Dangers of SQL Injection\n\n### Explanation:\nSQL Injection is a major web vulnerability that occurs when a malicious user inputs SQL code into a text field. The danger is that this allows the attacker to steal, modify, or delete sensitive data from the database. The best defense is to use complex SQL queries with lots of variables.", "label": 1}
{"text": "### Topic:\nCompiled vs. Interpreted Languages\n\n### Explanation:\nA Compiled Language (like C++) is translated into machine code once. An Interpreted Language (like Python) is translated line-by-line during execution. For this reason, interpreted languages are always slower than compiled languages for every task.", "label": 1}
{"text": "### Topic:\nBig O Notation\n\n### Explanation:\nBig O Notation is the mathematical language used to describe the efficiency of an algorithm's worst-case scenario. For example, an algorithm with O(n) is always slower than an algorithm with O(log n).", "label": 1}
{"text": "### Topic:\nAbstraction in OOP\n\n### Explanation:\nAbstraction in Object-Oriented Programming (OOP) is the technique of hiding the complex implementation details from the user. This is mainly achieved by using public classes and making all methods publicly accessible to the user so they can interact with the object.", "label": 1}
{"text": "### Topic:\nStatic vs. Dynamic Typing\n\n### Explanation:\nIn Static Typing (like Java), variable types are checked before the code runs. In Dynamic Typing (like Python), types are only checked while the code is running, which makes dynamic typing safer and less prone to unexpected runtime errors.", "label": 1}
{"text": "### Topic:\nDatabases: Relational vs. NoSQL\n\n### Explanation:\nA Relational Database stores data in rigid tables with predefined relationships. A NoSQL Database (like MongoDB) is often used for data that is highly structured and requires complex table joins. Relational databases are faster for flexible, evolving data structures.", "label": 1}
